[
{
    "job_url": "https://maximus.avature.net/careers/FolderDetail/Bradford-Leeds-Huddersfield-United-Kingdom-of-Great-Britain-and-Northern-Ireland-Hospitality-Trainer-Adult-Skills-WYCA-UK/34017",
    "description": "Be part of something great Maximus is a global organisation that specialises in providing health and employment services to millions of people every year. Here in the UK we employ around 5,000 people across the country to deliver services that have a profound impact on people’s lives. From assessments and health services to employability programmes and specialist support, we do work that matters with people who care. The role of the Adult Skills Trainer is to assess learner needs/skills through pre-course assessments, develop a ILP with SMART goals to address barriers/skills needs. Deliver, outstanding, personalised, accredited/non-accredited interventions with embedded personal/social development to help prepare learners for further learning/employment/improved confidence. Key Contacts & Relationships: Internal • Work as a key member of the team • Continuous contact and relations with all operational colleagues • Contact at times with representatives within other MAXIMUS operating divisions e.g. Central Division. External • Employers, agencies and other stakeholders e.g Local Authorities, WYCA, DWP/JCP, NCS etc.",
    "Job Posting Title": "Hospitality Trainer - Adult Skills",
    "Date": "Friday, February 6, 2026",
    "City": "Leeds",
    "Country": "United Kingdom",
    "Working time": "Full-time",
    "EEO Statement": "Maximus is committed to developing, maintaining and supporting a culture of diversity, equity and inclusion throughout the recruitment process. We know that feeling included has a dramatic impact on personal well-being and are working to ensure that no job applicant receives less favourable treatment due to any personal characteristic.  Advertisements for posts will include sufficiently clear and accurate information to enable potential applicants to assess their own suitability for the post. We are a Disability Confident Leader, thanks to our commitment to the recruitment, retention and career development of people with disabilities and long-term conditions. The Disability Confident scheme includes a guaranteed interview for any applicant with a disability who meets the minimum requirements for a job. When you complete your job application you will find a question asking you if you would like to apply under the Disability Confident Guaranteed Interview Scheme. If you feel that you have a disability and apply under this scheme, providing that you meet the essential criteria for the job, you will then be invited for an interview. Your Guaranteed Interview application will only be shared with the hiring manager and the local resourcing team. Where reasonable, Maximus will review and consider adjustments for those applicants who express a requirement for them during the recruitment process.",
    "Minimum Salary": "£",
    "Maximum Salary": "£"
},
{
    "job_url": "https://careers.avature.net/en_US/main/JobDetail/Argentina-Fullstack-Software-Engineer-Argentina/7922",
    "description": null
},
{
    "job_url": "https://dfiretailgroup.avature.net/en_US/careers/JobDetail/Stocktake-Team-Leader/16410",
    "description": "工作職責 - 負責到各區店舖進行貨物之盤點工作 - 領導及分派盤點員進行點算工作 - 監察點算過程及盤點後覆核的工作 - 維持盤點員紀律及對盤點員的指導工作 - 操作盤點電腦程式 - 拹助貨倉存貨 入職條件 - 良好粵語，一般簡單英語，懂讀寫中文 - 需具有兩年或以上零售經驗 工作時間 每週工作5天, 銀行假 上午7時30分至下午5時30分 工作地點 每天須流動到港、九、新界 (偶爾離島) 的不同店舖工作 員工福利 年終雙糧、交通津貼、勤工獎、超時津貼、12天有薪年假、17天公眾假期、完善醫療、住院福利、員工家屬醫療優惠（中西醫、跌打及牙醫）及集團購物優惠 有意應徵者請WhatsApp至 (852) 6092 7062 ( https://wa.me/85260927062 ) 預約面試 DFI零售集團為平等機會僱主，我們會確保每位應徵者提交給DFI零售集團的所有個人資料僅用於招聘及甄選用途，申請者提供之資料被絕對保密。凡未予錄用者，本公司將保留其申請資料不超過24個月。個人資料收集過程符合所有適用法律並符合人力資源管理實務守則。 如欲了解更多有關我們的業務和團隊，請瀏覽 www.DFIretailgroup.com 此招聘廣告由牛奶有限公司發行 Wellcome is the largest and longest established supermarket brand in Hong Kong with an extensive network of over 300 stores. Wellcome is committed to providing one-stop shopping convenience to customers through quality products at competitive prices and friendly service to serve the needs of different customers. We welcome applications from high calibre candidates to join our expanding team. DFI Retail Group is responsible for ensuring that all personal information collected from each Candidate presented to DFI Retail Group is used for recruitment purposes only and the data collection process is in accordance with all applicable laws and compliant with the Code of Practice on Human Resource Management. To find out more about Our Businesses and Our People, please visit our website https://www.dfiretailgroup.com",
    "Name": "Stocktake Team Leader",
    "Job Posting date": "09-Feb-2026",
    "Job Code": "J000966",
    "Country/Region": "Hong Kong",
    "Banner": "Wellcome",
    "Department": "Finance",
    "Section": "Multi-area",
    "Site": "Mobile Location",
    "Job Type": "Store Support Centre",
    "Job ID": "16410"
},
{
    "job_url": "https://deloittebe.avature.net/en_US/careers/JobDetail/Consultant-EPM-FSI/12111",
    "description": null,
    "Company": "Deloitte",
    "Business Unit": "Technology & Transformation",
    "Primary Location": "Zaventem",
    "Field of interest": "Finance & Risk",
    "Industry Focus": "Financial Services",
    "Recruiter": "Pliatsika, Evgenia - epliatsika@deloitte.gr"
},
{
    "job_url": "https://premium.avature.net/en_US/jobs/PipelineDetail?pipelineId=101566",
    "description": null
},
{
    "job_url": "https://infor.avature.net/careers/JobDetail/Business-Operations-Director/19219",
    "description": "Job Role of Automation and Transformation Team Leader: Job Description Director, Automation & Transformation – Managed Services Role Summary The Director of Automation & Transformation leads the strategic modernization of Managed Services operations supporting ERP customers. This role is responsible for building and scaling automation capabilities, standardizing global processes, reducing operational costs, and driving digital transformation across service delivery. The Director partners closely with Service Delivery Leadership, Engineering, Product, and Customer Success to ensure Managed Services evolves into a proactive, data‑driven, AI‑augmented organization. This leader will define and execute the automation roadmap, champion tooling standardization, deliver measurable efficiency improvements, and shape the future operating model for ERP Managed Services. Key Responsibilities Automation Strategy & Delivery Develop and own the global automation and transformation      strategy for ERP Managed Services. Drive AI/ML‑based automation initiatives to digitize workflows,      enable predictive operations, and increase service reliability. Oversee design and implementation of automation for: Monitoring, alerting, and compliance Incident prediction and auto‑remediation Workflow and process automation Dashboarding and operational reporting RPA, script‑based, and API‑driven automation Build reusable automation frameworks that scale across ERP      product lines and support tiers. Tooling & Platform Standardization Lead consolidation and standardization of Managed Services      tooling (e.g., ServiceNow , Certinia , monitoring      platforms, CI/CD, capacity planning). Ensure consistent adoption of global system processes and      governance models across all delivery centers. Partner with cross‑functional leaders to align automation and      tooling strategies with enterprise architecture and engineering roadmaps. Streamline fragmented systems to reduce technical debt and      improve operational visibility. Transformation Leadership Champion digital transformation and modern service delivery      practices. Lead innovation in areas like ChatOps, self‑healing automation,      predictive operations, and intelligent routing. Establish quality assurance frameworks, feedback loops, and      continuous improvement practices across tooling and automation. Cross‑Functional Collaboration Partner with Service Delivery, Customer Success, Product,      Engineering, and Support Operations to identify high‑value automation      opportunities. Facilitate ideation workshops with business groups and      stakeholders. Ensure timely communication of rollout plans, impacts, and      value realization to all stakeholders. Operational Excellence Drive cost optimization through automation, reduction in manual      effort, workload removal, and tooling consolidation. Introduce data‑driven processes to enhance decision‑making and      reduce operational variability. Improve onboarding efficiency, service consistency, and      delivery quality across global teams. Key Performance Indicators (KPIs) Operational cost savings driven      by automation and tooling consolidation. Efficiency gains : reduction in      manual hours, MTTR improvements, SLA compliance uplift. Ideas implemented from      innovation pipeline. Automation coverage metrics : % of      incidents auto‑remediated, % workflows automated. Platform standardization maturity across      global delivery teams. Adoption rates of new tools,      processes, and automation capabilities. Skills & Experience Requirements Technical Expertise Strong knowledge of enterprise support operations and ERP      Managed Services environments. Hands‑on experience with: ServiceNow (mandatory) RPA platforms (UiPath, Blue Prism, Power Automate) Monitoring & observability tools (Splunk, Datadog,       Dynatrace, ELK, Sumo Logic) CI/CD & DevOps tools (GitHub, Jenkins, Ansible, Chef) Scripting languages (Python, JavaScript, Shell) Cloud technologies (AWS, Azure) and automation frameworks Experience with ChatOps, API integrations, data pipelines, and      autonomous operations. Leadership & Strategic Skills Proven track record leading large‑scale transformation in      global service delivery or managed services environments. Executive‑level communication and stakeholder management. Ability to influence without authority across global and cross‑functional      teams. Strong analytical mindset with experience using data and AI/ML      to drive decision‑making. Experience managing complex tooling ecosystems and enterprise‑scale      automation portfolios. Preferred Qualifications 10–15+ years in Managed Services, Service Operations,      Automation Engineering, or related fields. 5+ years leading transformation or automation teams. Experience in ERP environments (e.g., Infor, SAP, Oracle, or      Microsoft Dynamics). Certification in ITIL, ServiceNow, DevOps, or Cloud Platforms      (preferred, not required). Success Profile The ideal candidate is a strategic thinker and hands‑on innovator who combines technical depth with operational excellence. They bring a continuous improvement mindset and thrive at transforming complex, global environments into streamlined, intelligent, automated service delivery organizations. About Infor Infor is where ambition meets impact. Join a global community of bold thinkers and innovators, where your expertise doesn’t just solve problems. it shapes industries, unlocks opportunities, and creates real-world impact for billions of people. At Infor, you’re not just building a career. you’re helping to build what’s next. Infor is a global leader in business cloud software products for companies in industry specific markets. Infor builds complete industry suites in the cloud and efficiently deploys technology that puts the user experience first, leverages data science, and integrates easily into existing systems. Over 60,000 organizations worldwide rely on Infor to help overcome market disruptions and achieve business-wide digital transformation. For more information visit www.infor.com Our Values At Infor, we strive for an environment that is founded on a business philosophy called Principle Based Management ™ (PBM™) and eight Guiding Principles: integrity, stewardship & compliance, transformation, principled entrepreneurship, knowledge, humility, respect, self-actualization. We have a relentless commitment to a culture based on PBM™. Informed by the principles that allow a free and open society to flourish, PBM™ prepares individuals to innovate, improve, and transform while fostering a healthy, growing organization that creates long-term value for its clients and supporters and fulfillment for its employees. Infor is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive work environment. Infor does not discriminate against candidates or employees because of their sex, race, gender identity, disability, age, sexual orientation, religion, national origin, veteran status, or any other protected status under the law. If you require accommodation or assistance at any time during the application or selection processes, please submit a request by following the directions located in the FAQ section . Fraud Awareness We have been made aware of unauthorized individuals posing as Infor recruiters, including some who have made fraudulent offers of employment. Please read our guidelines and protect yourself from recruitment scams. Fraud Privacy Policy We value your privacy at Infor. You may access our privacy policy here .",
    "Country": "India",
    "City": "Remote Location",
    "Job ID": "47847",
    "Department": "Infor Consulting Services"
},
{
    "job_url": "https://innocent.avature.net/externalcareers/JobDetail/Project-Portfolio-Manager-Technology-Transformation/1529",
    "description": "what you'll be doing We make little drinks that do big things, and we’re always looking for ways to do things better. That means change – the good kind – and we need someone who can help us make it happen. You’ll be hands‑on in turning plans into reality, keeping things moving, and helping make sure our change projects land well across the business. If you enjoy working with lots of different people, like solving problems, and get a buzz from seeing ideas turn into action, this could be right up your street. More specifically, you’ll: Support the planning and delivery of our annual Transformation & Technology (T&T) change plan, working closely with the Transformation Planning Manager. Help coordinate a portfolio of T&T projects, tracking progress and making sure things stay on course for time, cost and quality. Work with teams across the business (Finance, Marketing, Supply Chain, People and more) to help projects run smoothly and unblock issues. Prepare updates, insights and analysis for portfolio reviews and forums, helping keep everyone aligned and informed. Support project managers with tools, templates and best practice to help change land well across the business. Get involved in improving how we do change, spotting opportunities to make our processes clearer, simpler and more effective. you'll have Experience working on projects or programmes, ideally in an FMCG or fast‑moving environment (but that’s not a deal‑breaker). A good understanding of project or change management fundamentals (formal qualifications like Prince2 or MoP are a bonus, not a must). Strong organisation and communication skills – you’re comfortable juggling tasks and working with lots of different stakeholders. A problem‑solving mindset and a willingness to roll up your sleeves when things get tricky. A collaborative approach and a genuine interest in learning, improving and trying new ways of doing things. you'll get The chance to work on meaningful projects that help shape how our business grows and changes. Exposure to a wide range of teams and stakeholders across innocent. A supportive environment where you’ll learn from experienced change and transformation professionals. Opportunities to build your skills in project, portfolio and change management over time. We want innocent to be a great place to work , so we do lots of stuff to make people feel at home and try to make sure everyone’s career is shaping up the way they want it to. There are plenty of opportunities to have a go at something new or take things further. In exchange for helping us do business in the right way, you’ll get a solid rewards package that includes a salary (phew), private healthcare, a target-based bonus, and a bunch of other nice things like a day off on your birthday. And yes, you get free smoothies. We also know that not all our drinkers come from the same background, or think the same – so why should we? At innocent, we want to be a great place to work where a diverse bunch of people from all backgrounds can turn up and thrive. When we hire, we want all the juice, bits, and pulp that make you who you are. Even if you don’t think you can tick all the boxes, if the job sounds right for you, come and throw your hat in the ring. Probably best to get your skates on though, as we might close this early if we get loads of applications."
},
{
    "job_url": "https://virginmediao2.avature.net/en_US/giffgaffcareers/JobDetail/Engineering-Manager/102598",
    "description": null,
    "Location": "United Kingdom",
    "Job Type": "Full Time",
    "Ref #": "71451",
    "Who we are": "Do you want to join a connectivity provider that's up to good? At giffgaff, we do things differently. We call out the bad and find a better way. We're laser-focused on flexibility, value and mutual good. And we're proud to be a certified B Corp. This means we've joined a network of more than 2,000 UK companies who want to make a positive impact on people and the planet. Working at giffgaff is something you could be proud of too. You'll get the best of both worlds, the energy and fast pace of giffgaff, plus all the benefits that come with being part of our parent company, Virgin Media O2. Our business model is unique. We work with our members (our customers) to understand their needs in all areas of the business. We love this highly collaborative approach. We're always looking to acquire new members, and to do that we need the best people in our team. In return for your outstanding efforts, you'll be rewarded with a competitive salary and excellent benefits that are all about making your work life a winner. Take a look at our culture and benefits - you might just be surprised. Our bright and modern gaff is in Uxbridge, in leafy West London. But if commuting isn't for you, most of our roles can be hybrid or remote, or anywhere in between.",
    "The must haves": "In order to be considered, you must have the following experience; At least 2 years experience of managing teams and people. Strong team leadership and people management skills Experience with our tech stack, including Java (Spring) server-side development and/or React, JavaScript/TypeScript and React Native on the client side Strong advocacy and understanding of TDD (Test-Driven Development) Experience working with or promoting pair programming practices Knowledge of event-driven architecture",
    "The other stuff we are looking for": "We'd also love you to bring; Proven experience delivering projects in Agile environments Experience supporting or leading recruitment activities Ability to influence and champion engineering best practices",
    "What's in it for you": "Our goal is to celebrate our people, their lives and everything in-between. We aim to create a culture that empowers everyone to bring the best versions of themselves to work each and every day. We believe the most inclusive and diverse culture makes for a better business and a brighter world. Working at giffgaff means you get a bumper reward package bursting with benefits, and loads of extras you can add if you’d like to. These are designed to support both you and your loved ones, making sure that you’re covered no matter what life throws your way. We're all about hybrid working here, so expect to have a base location where you'll have the right facilities to enable amazing collaboration and quality time with your team, alongside all the right kit to work from home too.",
    "Next steps": "If we feel like a place where you can belong, we'd love to learn more about you as a person and your experience to date. Once you've submitted an application, the next steps of the process, if successful, are likely to include an initital call with a member of our talent team, followed by four stage of interview which includes a technical System Design round. Please note: Applications will be reviewed, and interviews conducted throughout the duration of this advert, therefore we may bring the closing date forward. We encourage all interested applicants to apply as soon as possible. If you're offered a job with us, it will be conditional, based on the passing of background checks. All roles require a criminal record check and some roles need a financial probity check. Your recruiter can provide you with more information, if needed. Thanks for your patience and for showing an interest in joining the giffgaff family."
},
{
    "job_url": "https://jrg.avature.net/en_US/careers/JobDetail/Senior-Marketing-Officer-Pizza-Hut/1965",
    "description": null,
    "Job Title": "Senior Marketing Officer (Pizza Hut)",
    "Market": "Hong Kong",
    "Brand": "Pizza Hut",
    "Department": "Marketing (MKT)",
    "Job Requsition Published Date": "06-Feb-2026",
    "Job Responsibilities:": "Assist in planning and executing the full spectrum of marketing plans and promotional strategies Support end-to-end marketing and promotion campaigns, from concept development to execution, including ATL, BTL, PR, POSM, and events Develop marketing campaigns, activations, and collaterals to drive brand awareness and business growth Work closely with internal stakeholders, external agencies, and vendors to ensure seamless project delivery Evaluate campaign effectiveness and conduct competitor benchmarking to identify market opportunities Monitor marketing budgets and ensure effective cost control Handle ad-hoc marketing projects as assigned",
    "Requirements:": "Degree holder in Marketing, Advertising, Business Administration, or related disciplines Minimum 4 years of relevant experience, preferably in Retail / F&B / FMCG industries Strong analytical, presentation, and problem-solving skills Excellent communication, interpersonal, and organizational abilities Passionate about the F&B industry, self-motivated, and detail-oriented Proficient in MS Excel, Word, PowerPoint, and Chinese word processing Excellent command of spoken and written English and Chinese What we need: Apply online with your CV and a cover Letter highlighting your experience, skills, and achievements. Jardine Restaurant Group is responsible for ensuring that all personal information collected from each Candidate presented to Jardine Restaurant Group is used for recruitment purposes only and the data collection process is in accordance with all applicable laws and compliant with the Code of Practice. To find out more about Our Businesses and Our People, please visit our website https://www.j rg.com/"
},
{
    "job_url": "https://careers.qatarairways.com/global/JobDetail/Web-Summit-National-Talent-Pool/77794",
    "description": null,
    "Job title": "Web Summit National Talent Pool",
    "Ref #": "26000024",
    "Location": "Qatar - Doha",
    "Job family": "Al Darb Qatarisation"
},
{
    "job_url": "https://engagecareers.inizioengage.com/en_GB/careers/JobDetail/Account-Specialist/22708",
    "description": null
},
{
    "job_url": "https://xerox.avature.net/en_US/careers/JobDetail/Accounts-Payable-Payment-Coordinator/48627",
    "description": "About Xerox Holdings Corporation At Xerox, we make work, work! For more than 100 years, Xerox has continually redefined the workplace experience. From the office to industrial environments, our differentiated business and technology offerings and financial services are essential workplace technology solutions that drive success for our clients and within our culture. Learn more at www.xerox.com and explore our commitment to diversity, inclusion and belonging. Job Description Position Summary We are seeking a detail-oriented and proactive Payment Coordinator to support Accounts Payable operations and lead the weekly payment decision process. This role requires strong analytical skills, sound judgment, and the ability to work independently in a dynamic, fast-paced environment. The successful candidate will confidently facilitate discussions, manage competing priorities, and ensure timely, accurate payment execution. Key Responsibilities Maintain and update multiple Excel spreadsheets to track invoice status and payment schedules. Monitor and manage disbursements to ensure alignment with approved budgets. Propose weekly payment budgets based on invoice pipeline and business priorities. Reconcile payments and resolve discrepancies in coordination with Accounts Payable and Finance teams. Track, respond to, and manage payment-related escalations promptly. Collaborate with internal stakeholders to ensure priorities are clear and understood. Support reporting and documentation needs related to payment activities. Categorize vendors into appropriate spend categories. Identify and implement process improvements to enhance efficiency and accuracy. Perform financial and operational analyses; propose metrics to improve payables management, forecasting, and timing. Qualifications Bachelor’s degree in Accounting, Finance, or related field (or equivalent experience). Prior experience in Accounts Payable, financial operations, or vendor relationship management preferred. Proficiency in Microsoft Excel (pivot tables, formulas, data analysis). Familiarity with SAP or similar ERP systems. Ability to synthesize data and make informed decisions under tight deadlines Strong organizational skills to track multiple details and maintain accuracy Effective communication to align stakeholders and resolve issues quickly",
    "City": "Cebu",
    "State/Province": "Central Visayas (Region VII)",
    "Country": "Philippines",
    "Department": "ACCOUNTING",
    "Date": "Tuesday, January 20, 2026",
    "Working time": "Full-time",
    "Ref#": "20037597",
    "Job Level": "Specialist",
    "Job Type": "Experienced",
    "Job Field": "ACCOUNTING"
},
{
    "job_url": "https://platinion.avature.net/CareersDeEn/JobDetail/Consultant-IT-Architecture-all-genders-BCG-Platinion/587",
    "description": "Posted 05-Sep-2024 Do you want to turn the challenges of digitization into the solutions of the future? Join us, BCG Platinion, in tackling the core IT issues of leading global companies. Deploy customized platforms, architectures, strategies, and organizations to leverage the digital potential of our customers and drive true innovation, with state-of-the-art tools such as cloud computing, AI, blockchain, microservices, and containerization. Add your individual strengths to our unique team, always there to support you. Together with Boston Consulting Group and our clients, we turn digital visions into reality. Shape the world of tomorrow You'll shape the digital transformation of globally leading companies, ensuring their success by evaluating our clients' digital capabilities and performing feasibility studies You'll manage small, agile development teams in strategic IT implementation programs, establish modern practices like DevOps and CI/CD, and be responsible for the technical implementation of crucial digital requirements such as cyber resilience You'll analyze, develop, and optimize cutting-edge, customized IT architectures while applying your comprehensive understanding of legacy IT, enterprise solutions, and current market developments and trends such as cloud computing and microservices This is how you can make a difference You have a degree in computer science, (business) informatics, or a related discipline You have at least two years of relevant experience in IT Consulting or software development You know that modern tools such as machine learning, cyber resilience, DevOps, agile methods, AI, and robotics aren't just buzzwords, but essential to sustainable IT architectures You have broad technical expertise and interest in technology trends You feel particularly comfortable in interdisciplinary teams and global contexts and are flexible and willing to travel You're good at understanding and communicating complex topics in both German and English How you can grow with us We guarantee constant new development incentives in an open and rewarding work environment.  You'll face challenges every day together with a dedicated team of talented colleagues. Individual training offers and a culture of open feedback will provide the framework you need to explore and perfect your own strengths. Our modern structures enable you to stay focused. This includes easy travel booking, our excellent back-office support and a comprehensive Knowledge Center. With our regular office Fridays and legendary events, we cultivate a strong and close team network from which you will also profit beyond your case work. Become a part of our team BCG Platinion is an Equal Opportunity Employer and actively promotes diversity and inclusion. . We consider all qualified applicants regardless of ethnic and social background, age, gender, sexual identity, religion, ideology or disability. Apply now with your CV, a meaningful project list and all relevant references via our online portal or contact David Körte (+49 221 58958-555) if you have any questions. Further information at karriere.bcgplatinion.de #BCGPlatinion < Back to search results Apply now Share Share Consultant IT Architecture (all genders) - BCG Platinion with Facebook Share Consultant IT Architecture (all genders) - BCG Platinion with Twitter Share Consultant IT Architecture (all genders) - BCG Platinion with a friend via e-mail Print Bookmark This Page"
},
{
    "job_url": "https://careers.tql.com/en_US/TQLexternalcareers/JobDetail/Cincinnati-Ohio-United-States-Sales-Representative-Uncapped-Commission-Cincinnati-HQ/5278?source=External+Career+Site",
    "description": "About the role: Entry level sales at TQL is an opportunity to build a career with an industry leader that offers an award-winning culture and high earning potential with uncapped commission. This is more than just sales; you'll build relationships, negotiate freight deals, solve complex logistics issues and manage shipments from pickup to delivery. No experience necessary: we offer a paid, hands-on formal training program in sales and logistics. For a look at a day in the life of a TQL Sales Representative, watch this video at https://tql.avature.net/LifeInSales . What’s in it for you: $40,000 - $50,000 minimum compensation your first year, based on education Uncapped commission opportunity Our average sales representative hits six figures after three years of selling Want to know what the top 20% earn? Ask your recruiter Who we’re looking for: You compete daily in a fast-paced, high-energy environment You’re self-motivated, set ambitious goals and work relentlessly to achieve them You’re coachable , enjoy solving problems and thinking on your feet College degree preferred , but not required Military veterans encouraged to apply What you'll do: Receive 6 months of direct training from experienced Logistics Account Executives Help your account executive solve customer needs, find carriers for time-sensitive freight and manage daily operations Participate in hands-on and virtual training sessions Develop negotiation skills through prospecting and cold calling Build your book Use your training to meet sales metrics and become eligible for commission Establish relationships to close new customers Negotiate prices with customers and carriers Resolve freight issues to ensure timely pickup and delivery What you need: Elite work ethic, 100% in-office Strong negotiation skills with ability to handle conflict Entrepreneurial mindset and exceptional customer service Why TQL: Certified Great Place to Work with 800+ lifetime workplace award wins Outstanding career growth potential with a structured leadership track Comprehensive benefits package Health, dental and vision coverage 401(k) with company match Perks including employee discounts, financial wellness planning, tuition reimbursement and more Where you'll be: 4289 Ivy Pointe Boulevard, Cincinnati, Ohio 45245 Employment visa sponsorship is unavailable for this position. Applicants requiring employment visa sponsorship now or in the future (e.g., F-1 STEM OPT, H-1B, TN, J1 etc.) will not be considered.",
    "Country": "USA",
    "State": "Ohio",
    "City": "Cincinnati"
},
{
    "job_url": "https://leonardcheshire.avature.net/en_GB/careersmarketplace/JobDetail/St-Helens-United-Kingdom-of-Great-Britain-and-Northern-Ireland-Team-Leader/325",
    "description": null,
    "Location": "St Helens",
    "Service name": "St Helens",
    "Closing date": "18-02-26",
    "Job type": "Full-Time",
    "Employment type": "Permanent",
    "Salary": "£14.70 per hour"
},
{
    "job_url": "https://careers.wcgclinical.com/careers/FolderDetail/CTMS-Analyst-Remote/4381",
    "description": null
},
{
    "job_url": "https://deloittecm.avature.net/en_US/careers/JobDetail/Experienced-Monitor-Deloitte-Strategy/7738",
    "description": null,
    "Job Name": "Experienced - Monitor Deloitte - Strategy",
    "Location": "Milano, Roma",
    "Business Area": "STRATEGY & TRANSACTIONS",
    "Seniority": "Experienced",
    "Business Function": "STRATEGY, RISK & TRANSACTIONS ADVISORY"
},
{
    "job_url": "https://careers.arcb.com/careersmarketplace/JobDetail/Phoenix-Arizona-United-States-Account-Manager-I-Phoenix-AZ/27573",
    "description": null,
    "Company": "ArcBest",
    "Location": "Phoenix, AZ",
    "Workspace": "Hybrid",
    "Pay Type": "Salary, Full-Time",
    "Job ID": "27573"
},
{
    "job_url": "https://fortress.avature.net/careers/JobDetail/New-York-New-York-United-States-VP-Information-Security-Lead/5344",
    "description": "VP, Information Security Lead New York Corporate Group Ref # 3666 Date published 07-Jan-2026 VP, Information Security Lead New York, NY (Hybrid) About Fortress Fortress Investment Group LLC is a leading, highly diversified global investment manager with approximately $54 billion of assets under management as of September 30, 2025. Founded in 1998, Fortress manages assets on behalf of over 2,000 institutional clients and private investors worldwide across a range of credit and real estate, private equity, and permanent capital investment strategies. Fortress is headquartered in New York, with offices in Abu Dhabi, Atlanta, Dallas, Greenwich, Hong Kong, London, Los Angeles, Madrid, Menlo Park, New York, Rome, Sydney and Tokyo. About the Position Summary Fortress’s Information Technology team seeks a highly motivated and hands-on Vice President, Information Security Lead to join the Information Security team. The Information Security Lead will be responsible for the design, execution, oversight, and remediation of the firm’s cybersecurity framework. This role requires a unique blend of regulatory expertise (DORA, GDPR, CPRA), business resiliency, and application security. You will act as a primary lead for assessing application-level risks, managing the business impact of potential disruptions, and ensuring that our global vendor ecosystem meets stringent security standards. Responsibilities • Lead the implementation and maintenance of controls for DORA (Digital Operational Resilience Act), ensuring the firm meets European operational resilience standards. • Serve as a subject matter expert for GDPR (General Data Protection Regulation) and CPRA (California Privacy Rights Act) compliance, managing data mapping, subject access requests, and privacy impact assessments. • Execute the security vetting process for new vendors; perform periodic due diligence as needed. • Conduct deep-dive application security risk assessments for proprietary applications and third-party software. • Lead the Business Impact Analysis (BIA) process to identify critical business functions and define Recovery Time Objectives (RTO) and Recovery Point Objectives (RPO). • Partner with Infrastructure teams to design, document, and test disaster recovery plans, ensuring high availability for trading and investment operations. • Serve as a senior escalation point for security incidents, assisting in containment, eradication, and post-mortem analysis. • Assist with managing and monitoring the performance of our security operations center. Respond to escalated alerts as needed. • Develop security metrics and risk posture dashboards for senior leadership. • Lead and implement various technology projects to improve the security posture of the firm. Qualifications • 7–12 years of progressive experience in Information Security, preferably within Financial Services or Alternative Investment Management industries. • Proven track record of implementing controls associated with DORA, NIST, and other various regulatory frameworks. • Bachelor’s degree in Computer Science, Cyber Security, Business Administration, or related field. • Certifications: CISSP (Certified Information Systems Security Professional), CISM (Certified Information Security Manager), or CISA (Certified Information Systems Auditor) • Excel as a self-motivated individual who can work on their own, as well as integrated with the infrastructure engineering and application development teams in joint projects. • Evaluate situations and respond with solutions quickly in a high-paced and high-pressure environment. • Build relationships with both IT and business personnel from all levels across the firm. The base salary range for this position is expected to be between $160,000 and $175,000. The base salary range proposed for this role has been set forth to comply with local law, but salary is only one element of the total compensation for this role. The base salary range suggested above does not include compensation elements such as bonuses, overtime and deferred cash (each of which are applicable in certain roles), benefits, perquisites, and company contributions to employee 401(k) accounts. Such other pay components often result in total compensation materially exceeding base salary for a particular role. Total compensation as well as base salary for a role depend in part upon individual performance, years of service, experience, geographic considerations, the performance and the needs of particular business units, company performance, and general market conditions. Maximum Salary 175,000 Minimum Salary 160,000 Apply Now Email",
    "Ref #": "3666",
    "Date published": "07-Jan-2026",
    "Maximum Salary": "175,000",
    "Minimum Salary": "160,000"
},
{
    "job_url": "https://cdcn.avature.net/careers/JobDetail/Respite-Provider/5793",
    "description": "If you would like more information about our company, you can visit our website here: Who We Are - CDWI This is a heartwarming opportunity for compassionate providers who love making a difference! We work with members throughout Wisconsin to find providers that fit each of their needs. Our goal is to help individuals be in more control of their own supports and to have a say in who is assisting them. This helps them to stay in their own homes as long as possible. Are you compassionate, reliable and have great communication skills? Do you love helping people? Do you love working with youth and families? If you answered yes to the above, we would love to hear from you! Position is for a young boy. More details about kiddo are discussed during the interview! We are seeking a part-time Respite Provider to provide care and support for an active, fun guy! This is a part-time position where you will provide care in this client's home & in local community! Schedule: • Saturdays and week day evenings • Some flexibility appreciated if schedule needs to be changed from time to time Wage: • $14.13/hour Duties: • Safety Supervision – elopement experience preferred • Play video games, work on puzzles, outdoor activities • Arts & Crafts • Some personal cares may be needed if an accident happens Qualifications: • Must pass a caregiver background check • Reliable & Dependable • Experience with ABA therapy or kids preferred",
    "Date": "Wednesday, November 26, 2025",
    "Location": "WI - Eau Claire",
    "Position Level": "Individual Contributor I",
    "Employment Type": "Part time",
    "Career Field": "Caregiver",
    "Base Min.": "$ 14.13",
    "Base Max.": "$ 14.13"
},
{
    "job_url": "https://forvis.avature.net/campuscareers/JobDetail/United-States-Associate-Audit-Fall-2027-Des-Moines/14126",
    "description": "Are you an accounting student striving for CPA eligibility and looking for a full-time opportunity in Audit?  At Forvis Mazars, you can use your critical thinking abilities to help clients solve problems or apply your social skills to build rewarding business relationships. You will work with clients from a variety of industries as you develop your technical skills and strengthen the foundation on which you will build your career. Whether you choose to start in audit or tax, you will be coached by our experienced staff and management personnel. As your skill set grows, you will assume greater responsibility and actively participate in determining your career path. How you will contribute: Completing audit testing on financial statement accounts such as cash, accounts payable, or fixed assets Working with client personnel to reconcile account differences and analyze financial data Helping to draft management letter comments and the audit report Participating in client meetings alongside Forvis Mazars partners and managers We are looking for people who have Forward Vision and: Effective time management Strong oral and written communication skills Ability to work well with a team as well as independently Problem-solving attitude Willingness to take initiative Close attention to detail Ability to work under pressure and against deadlines Minimum Qualifications: Associate positions require a bachelor's degree Candidates must be eligible to sit for the CPA exam in at least one U.S. State by the start date of the role Solid technical accounting knowledge Proficiency in Microsoft Office Suite Must have reliable transportation to and from your assigned office and be able to attend off-site meetings and events in person Preferred Qualifications: Prior internships in a public accounting firm performing audit work Applicants for positions with Forvis Mazars must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.",
    "Name": "Associate Audit Fall 2027 | Des Moines",
    "Posting Title": "Associate Audit Fall 2027 | Des Moines",
    "Ref #": "2236180",
    "Date Published": "Friday, December 12, 2025",
    "City": "West Des Moines",
    "State": "Iowa",
    "Country": "United States",
    "Job Category": "Entry Level",
    "Advertised Location": "US-IA-Des Moines",
    "Working time": "Full Time"
},
{
    "job_url": "https://rhgchina.avature.cn/en_US/careers/FolderDetail/Liaoning-China-Team-Leader-So-Shenyang/1844",
    "description": null,
    "Country/Region": "China Mainland",
    "Province/City": "Shenyang",
    "Location": "New World Shenyang",
    "Department": "Food & Beverage - Services",
    "Job Type": "Full-time Permanent"
},
{
    "job_url": "https://jobsearch.harman.com/en_US/careers/JobDetail/SW-Project-Engineer-Telematics/29809",
    "description": "About the Role At HARMAN, we’re not just building software—we’re shaping the future of mobility. As a Software Project Engineer in our Connectivity team, you’ll lead the development of cutting-edge telematics solutions that transform vehicles into intelligent, connected platforms. From 5G to V2X, your work will power the next generation of automotive innovation. In this role, you’ll serve as the technical lead and customer-facing representative for software development in key telematics domains. You’ll collaborate with global teams to define, develop, and deliver embedded software that meets the highest standards of performance, safety, and reliability. This position is also a strategic steppingstone toward a future Functional Owner role, where you will be expected to take full ownership of software domains and lead cross-functional project execution from concept to launch. What You Will Do Act as the primary technical interface for customers (JOEMs), representing the software domain team Lead software development and integration for new product development projects Translate customer and system-level requirements into detailed technical specifications Ensure traceability and alignment between system, technical, and customer requirements Create and present system and technical requirement proposals for internal and external stakeholders Lead DFMEA/DRBFM creation and reviews with global teams and customers Estimate development efforts and align features with project milestones Track and manage the full software development lifecycle (V-Model) Coordinate with software project leaders to ensure successful execution Demonstrate leadership and ownership capabilities with the goal of evolving into a Functional Owner role, driving end-to-end responsibility for software domains in future projects What You Need Bachelor’s degree in Computer Science or related field 3+ years of experience in embedded software development (C/C++) 3+ years of experience leading global development teams Strong knowledge of inter-process communication, threading, and socket programming Proficiency in embedded operating systems and debugging tools (e.g., GDB) Fluent in Japanese and business-level English What is Nice to Have Experience in automotive software development Understanding of TCP/IP protocols and secure coding practices Familiarity with UML, Agile methodologies (SCRUM, SAFe), and Automotive SPICE® (especially SWE.2) Knowledge in any of the automotive standards like ISO24089, ISO26262, and ISO21434 What Makes You Eligible Be willing to travel up to 30%, domestic only OR domestic and international travel. What We Offer We offer an authentic diverse, equal, and inclusive work environment that fosters and encourages professional and personal development in a truly global organization. You will work on products and services that touch people’s lives and will change the industrial standards, being a part of the transformations in our industry. Our work environments are fast paced, challenging, empowering, collaborative, flexible and exciting. We offer our own HARMAN University with regular updates on the new technologies and trends by utilizing various sessions organized by Self Learning and Development Trainings to help grow and advance talent. We offer competitive compensation/benefit programs and recognition programs. #LI-Hybrid #LI-BG4 You Belong Here HARMAN is committed to making every employee feel welcomed, valued, and empowered. No matter what role you play, we encourage you to share your ideas, voice your distinct perspective, and bring your whole self with you – all within a support-minded culture that celebrates what makes each of us unique. We also recognize that learning is a lifelong pursuit and want you to flourish. We proudly offer added opportunities for training, development, and continuing education, further empowering you to live the career you want. About HARMAN: Where Innovation Unleashes Next-Level Technology Ever since the 1920s, we’ve been amplifying the sense of sound. Today, that legacy endures, with integrated technology platforms that make the world smarter, safer, and more connected. Across automotive, lifestyle, and digital transformation solutions, we create innovative technologies that turn ordinary moments into extraordinary experiences. Our renowned automotive and lifestyle solutions can be found everywhere, from the music we play in our cars and homes to venues that feature today’s most sought-after performers, while our digital transformation solutions serve humanity by addressing the world’s ever-evolving needs and demands. Marketing our award-winning portfolio under 16 iconic brands, such as JBL, Mark Levinson, and Revel, we set ourselves apart by exceeding the highest engineering and design standards for our customers, our partners and each other. If you’re ready to innovate and do work that makes a lasting impact, join our talent community today! Important Notice: Recruitment Scams Please be aware that HARMAN recruiters will always communicate with you from an '@harman.com', ‘@careers.harman.com’ or ‘harmanglobal.avature.net’ email address. We will never ask for payments, banking, credit card, personal financial information or access to your LinkedIn/email account during the screening, interview, or recruitment process. If you are asked for such information or receive communication from an email address not ending in one of the above email domains about a job with HARMAN, please cease communication immediately and report the incident to us through: harmancareers@harman.com. HARMAN is proud to be an Equal Opportunity employer. HARMAN strives to hire the best qualified candidates and is committed to building a workforce representative of the diverse marketplaces and communities of our global colleagues and customers.  All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.HARMAN attracts, hires, and develops employees based on merit, qualifications and job-related performance.( www.harman.com )",
    "Location:": "Ariake - Tokyo, Japan",
    "Additional Location:": "Nagoya - Aichi, Japan - Chome",
    "Job Family:": "Engineering",
    "Worker Type Reference:": "Regular - Permanent",
    "Pay Rate Type:": "Salary",
    "Career Level:": "T3",
    "Job ID:": "R-50337-2025"
},
{
    "job_url": "https://bloomberg.avature.net/careers/JobDetail/Sales-Use-Tax-Accountant-Tax-Finance-Administration/17310",
    "description": "The energy of a newsroom, the pace of a trading floor, the buzz of a recent tech breakthrough; we work hard, and we work fast - while keeping up the quality and accuracy we're known for. It's what keeps us inventing and reinventing, all the time. Our culture is wide open, just like our spaces. We bring out the best in each other through collaboration. Through our countless volunteer projects, we also help network with the communities around us, too. You can do amazing work here. Work you couldn't do anywhere else. It's up to you to make it happen. What's the role Bloomberg Tax is currently seeking a Sales and Use Tax Specialist to join the team. The successful candidate should have a background in preparing multi-states sales and use tax refund claims, indirect tax returns, performing tax research, strong organization and time-management skills, good written and verbal communication skills, and be committed to delivering excellent service to internal and external business partners. Attention to detail, resourcefulness, the ability to multitask and a collaborative nature are essential to the team and are important in responding effectively to issues and requests from our business partners. We’ll trust you to: Prepare and assist in defense of sales and use tax refund claims Perform data analytics for indirect tax projects Research various indirect tax matters and document conclusions Prepare indirect tax compliance, including sales and use, gross receipts, property and other business tax compliance Participate in the defense of indirect tax audits and the calculation of indirect tax reserves and budgets Track indirect tax developments and analyze their implications for products and services Contribute to business and process improvement projects and support of company-wide initiatives Collaborate with internal and external teams regarding various indirect tax accounting matters and indirect tax compliance Support due diligence activities in connection with a variety of transactions and business plans You’ll Need to Have: Bachelor’s degree in Accounting 2-5 years indirect tax experience including audit defense or reverse audit experience Proficient in Microsoft Office, especially creation and manipulation of Excel spreadsheets Experience with SAP or other ERP system Experience with tax research tools, such as BTAX Self-starter, capable of working independently Strong interpersonal communication skills Strong organizational skills and ability to prioritize multiple tasks We’d Love to See: Experience with Vertex Experience with Power Query or Alteryx Salary Range = 95000 - 115000 USD Annually + Benefits + Bonus The referenced salary range is based on the Company's good faith belief at the time of posting. Actual compensation may vary based on factors such as geographic location, work experience, market conditions, education/training and skill level. We offer one of the most comprehensive and generous benefits plans available and offer a range of total rewards that may include merit increases, incentive compensation (exempt roles only), paid holidays, paid time off, medical, dental, vision, short and long term disability benefits, 401(k) +match, life insurance, and various wellness programs, among others. The Company does not provide benefits directly to contingent workers/contractors and interns. Discover what makes Bloomberg unique - watch our podcast series for an inside look at our culture, values, and the people behind our success.",
    "Location": "New York",
    "Business Area": "Accounting and Finance",
    "Ref #": "10049133"
},
{
    "job_url": "https://unifi.avature.net/careers/JobDetail/273-ATG-Delta-Security-Employee-Screener-CC/9574",
    "description": null,
    "Job Title": "Security Employee Screener - CC ATL",
    "Date": "Saturday, February 7, 2026",
    "Entity": "Unifi Security LLC",
    "State": "Georgia",
    "City": "Atlanta",
    "Base Pay Rate:": "$ 15.00",
    "Full/Part Time": "Full Time",
    "Exempt or Non-Exempt Position": "Non-Exempt",
    "Shift": "A.M. shift, Overnight shift, P.M. shift"
},
{
    "job_url": "https://uskpmgats.avature.net/careers/JobDetail?jobId=128775&srcCat=Internet&specSrc=US+KPMG+External+Career+Site",
    "description": null
},
{
    "job_url": "https://tescoinsuranceandmoneyservices.avature.net/careers/JobDetail/Customer-Service-Team-Leader/2780",
    "description": null,
    "Job Title": "Customer Service Team Leader",
    "Ref #": "9471",
    "Location": "Glasgow",
    "Department": "IMS - IMS Car and Home (Mgt) - BW1",
    "Business Area": "Customer Service",
    "Working time": "Full-Time",
    "Date Published": "30-01-2026"
},
{
    "job_url": "https://insperity.avature.net/en_US/careers/JobDetail/Statewide-Indiana-United-States-Virtual-Physical-Science-Teacher-Grades-7-12-Indiana-Statewide/21099",
    "description": "Our Mission: The mission of the Hoosier College and Career Academy is to provide personalized, virtual learning opportunities to all Indiana students regardless of circumstances and abilities. Our Vision: Through virtual platforms, research-based academic standards, and meaningful partnerships, we will prepare today’s  learners for tomorrow’s ever-changing career and academic opportunities. Join with us in helping students in grades 7-12 reach their true potential and enjoy teaching from the comfort and safety of your home!  Signing bonuses are available for some positions. Virtual Physical Science Teacher, Grades 7-12 - Indiana Statewide Hoosier College and Career Academy SUMMARY: The position of teacher at Hoosier College and Career Academy is a highly qualified, state-certified teacher responsible for delivering specific course content in an on-line environment. REQUIRED QUALIFICATIONS: Bachelor's degree AND Three (3) years of teaching experience AND Meet requirements for Highly Qualified Teacher (HQT) Licensing: Appropriate licensing qualifying you to teach Physical Science Preferred Qualifications: On-line teaching experience High Ability, Special Education or other endorsements Certificates and Licenses: Active Indiana state teaching certification for appropriate content area and grade level. ESSENTIAL FUNCTIONS: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Learns the entire K12 curriculum for assigned grade levels and is able to demonstrate knowledge of how state standards align with it; Understands how both diverse and unique characteristics of students and their families impact required support; Augments course content according to prescribed policies and procedures using appropriate asynchronous and synchronous tools; Create, develop and submit lesson plans weekly; Orients students to their course, communicates requirements, sets and enforces deadlines, maintains regular office hours and conducts instructional sessions; Takes ownership for student’s academic progress and attendance communicating high expectations and showing active interest in student’s achievement; Collaborates with grade-level team, administration, interventionists, Special Education teachers and instructional coaches regarding instruction, resources, interventions and data-driven decision making to support student success Provides instruction to help students master K12 curricular objectives Prepares students for high stakes standardized tests; Establishes and maintains positive rapport with families and regularly communicates with students and learning coaches/parents to keep them adequately apprised of the student’s progress and issues; Supports learning coaches/parents with student curricular and instructional issues in a virtual classroom environment, balancing the flexibility of the K12 curriculum with proper enforcement of Academy policies and procedures; Grades submitted, required student work and maintains grade book; Generates formal and informal reports regarding student progress, alerting administrators to concerns about student performance and progress; Creates and manages a home office; Supports students and learning coaches with the set-up and maintenance of their learning environment including basic computer troubleshooting. Utilizes data analysis and data driven instruction Follows Staff Handbook expectations OTHER DUTIES AND RESPONSIBILITIES: The below statements are intended to describe the general nature and scope of work being performed by this position. This is not a complete listing of all responsibilities, duties and/or skills required; other duties may be assigned. Proctors site-based exams; Follow the Community Events Policy in Staff handbook Collects and analyzes formative and summative assessments Teaches scheduled Class Connect sessions for specific subject areas and homeroom Collaborates with peers in order to provide a positive experience for students; Builds community by contributing to school message boards, newsletters and events; Travels to and participates in staff meetings, school outings, marketing events, state testing, professional development sessions, and other experiences; Maintains records regarding students in accordance with school policy and state requirements; prepares reports regarding students and classroom matters as directed; Provides direct instruction to students as needed Participates in committees as required. OTHER REQUIRED QUALIFICATIONS: Strong interpersonal skills emphasizing tact, promptness, patience and courtesy; ability to establish a professional, effective rapport with students Proficiency in Microsoft Excel, Word, Microsoft Office, Power Point and Outlook, as well as Internet research methods and report writing techniques; Utilizes computer software associated with curriculum; obtains additional training in technology as required Able to read data and determine what steps are needed to assist students academically on an individual and/or classroom basis Able to adapt learning plans to meet different needs and learning styles; create an instructional and whole class environment favorable to learning and personal growth Communicate effectively both orally and in writing Demonstrates the use of good judgment in decision-making Great organizational and time management skills Customer service orientation to include promptness and appropriateness of responses to needs and requests of students and learning coaches Understanding of applicable sections of the State Education Code and other pertinent regulations Obtains additional licensing as required Ability to travel within and between assigned geographic areas to support students; Attend regularly scheduled meetings and participate in school activities, open houses and orientations Ability to pass required background check To Apply for This Position: Please follow this link into the Indiana Department of Education's career site Nimble to create your Profile, upload your resume and any other documents that you wish to have considered, and apply directly for this position - https://app.hirenimble.com/jobview/94336 . Benefits: In return for your hard work, Hoosier College and Career Academy offers an attractive compensation package of salary and an outstanding benefits package. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.",
    "Client / Corporate": "Client",
    "Work Mode": "In-Office",
    "Name": "Virtual Physical Science Teacher, Grades 7-12 – Indiana Statewide",
    "Job ID": "21099",
    "City": "Statewide",
    "Published date": "06-Aug-2025",
    "State": "Indiana",
    "Country": "United States"
},
{
    "job_url": "https://mhcta.avature.net/careers/JobDetail/2026-Summer-Operations-Internship-S-Ft-Worth/12356",
    "description": "Murphy-Hoffman Company (MHC-Kenworth) is a multi-state network of Kenworth truck dealers providing more than 50,000 customers with a full range of truck services.  MHC's Operations Intern Program is a 12-week version of our Management Trainee Program.  Over the course of the summer, you will be given a hands-on deep dive into how our Parts or Service Department operates, by rotating through each position in the department and helping contribute to the business. Execute business initiatives while receiving hands-on experience in all facets of the dealership. Utilize education, training, and experience to perform assigned job functions under close supervision of a manager or other designated employees. Develop skills necessary to rotate within the assigned department to get a comprehensive understanding of running the business. Opportunity to make an impact on the business by conducting a summer-long process improvement project. The Summer Management Operations Internship is a pipeline into MHC\"s Full-Time Management Trainee Program! What's in it for you: Starting pay $15-23 per hour On-the-job exposure to leading a business within a billion-dollar industry! On-the-job training and succession planning for personal career goals Opportunities for networking and professional connection Qualifications Actively pursuing a graduate or undergraduate degree at an accredited college or university. Willingness to work 40 hours per week for 10-12 weeks during the summer months. Leadership and sales skills strongly preferred. Strong commitment to providing quality work and excellent customer service. Ability to accept constructive feedback.",
    "Job Title": "2026 Summer Operations Internship- S Ft Worth",
    "Business Function": "Corporate",
    "Branch Name": "MHC Kenworth-South Fort Worth",
    "Date": "02-07-2026",
    "Address": "5001 S Interstate 35W",
    "City": "Alvarado",
    "State": "TX",
    "Qualifications": "Actively pursuing a graduate or undergraduate degree at an accredited college or university. Willingness to work 40 hours per week for 10-12 weeks during the summer months. Leadership and sales skills strongly preferred. Strong commitment to providing quality work and excellent customer service. Ability to accept constructive feedback."
},
{
    "job_url": "https://jobs.frequentis.com/careers/JobDetail/ROU-DevOps-Engineer-MosaiX/3031",
    "description": null
},
{
    "job_url": "https://primero.avature.net/en_GB/careers/JobDetail/23517-Trainer-and-Assessor/8543",
    "description": "HSE Trainer Assessor If you’re looking for a career with a company that has a ‘Can Do’ attitude, then look no further than Primero. We’re a team of skilled and determined problem solvers, who back our projects, and each other. We’re energised by our culture, anchored by our values, and driven to deliver for our clients. Join us if you take pride in having a ‘Can Do’ attitude. About Us Primero, a subsidiary of NRW Holdings, is a multi-national engineering, procurement, and construction business. Since we were founded in 2011, we’ve grown and diversified, delivering projects in over ten different countries, spanning five continents, from locations in Australia and North America. Our rapid growth is testament to our ability to deliver quality project outcomes, safely and on time. Working with us you’ll learn from some of the brightest and smartest minds in the business, while delivering important projects throughout Australia and overseas, giving you the opportunity to gain access to unique experiences across a huge range of sectors, from gold to lithium and new energy. Find out what a career at Primero can do for you. Your Opportunity We are looking for HSE Trainer Assessor to join our site team working on a billion dollar gold expansion project. Roster: 2:1 Your Key Responsibilities * Deliver onsite training and induction sessions * Identify and assess future and current training needs, through job analysis, in consultation with line managers * Assist in coordinating external trainers and assessors’ * Maintain accurate records of training progress and assessment outcomes * Provide accurate and timely training compliance reports, information, and support as required * Support the implementation of approved training and development initiatives * Support Training and assessment activities as required What You ‘Can Do’ * Certificate IV Training and Assessment. * Demonstrated experience in a similar position, within the construction or resources industries * Ability to demonstrate strong relationship building and networking skills. * Strong verbal and written communication skills. * Proven track record in managing training compliance in a medium to large organisations. * Proficient with modern IT applications including Microsoft Excel, Work and Outlook. * Experience developing and managing training needs analysis. What we ‘Can Do’ for you: * Competitive Compensation * Contemporary Rostering * Career Opportunities * Paid Parental Leave * Health and Wellbeing Support * Benefits & Discounts * Employee Referral Rewards If you're looking for a career where you experience more 'Can Do', then we're the team for you. Find out what a Primero career Can Do for you. APPLY NOW If you believe you have what it takes and want to work for a company who put its people first, please apply now. Primero is an Equal Opportunity Employer and strongly encourages female and Aboriginal and Torres Strait Islander applicants. Follow us on LinkedIn for news, updates and career opportunities.",
    "Name": "23517 - Trainer and Assessor",
    "Ref #": "1272110",
    "Date": "Wednesday, February 4, 2026",
    "Department": "Health, Safety and Environment",
    "Business unit": "Health, Safety and Environment"
},
{
    "job_url": "https://pepsicoglobalpontoon.avature.net/careers/JobDetail/United-States-Delivery-Merchandiser-Specialist/509287",
    "description": null
},
{
    "job_url": "https://jobs.bmc.com/Careers/JobDetail/Account-Mgr-United-Kingdom/46135",
    "description": null,
    "Job Name": "Account Mgr - United Kingdom",
    "Country": "United Kingdom",
    "State": "NA",
    "Date Published": "18-Dec-2025",
    "Job ID": "46135",
    "Travel": "up to 50%",
    "CareerArc Code": "CA-NB"
},
{
    "job_url": "https://uop.avature.net/careers/JobDetail/FA100-Associate-Faculty-Nurse-Practitioner-Women-s-Health-Management-Part-Time-Faculty-Virtual/25603",
    "description": "Skip to content Search jobs Talent Community Login Associate Faculty - Nurse Practitioner Women's Health Management - Part Time Faculty (Virtual) General Information Location: US-AZ - Phoenix Position Type: Part Time Virtual Eligible: Yes Ref #: 7242 College/School: College of Nursing Description and Requirements At the University of Phoenix, we are committed to the future of work by providing a fully remote, work-from-home environment. This strategy enables us to attract top talent nationwide. Are you looking for a rewarding and fulfilling position that offers challenging work and the opportunity to make a significant impact while collaborating with a team of fun, innovative individuals? Would you prefer to work with an organization that positively contributes to the world? If so, we would love to hear from you! Are you searching for a rewarding, fulfilling position that offers challenging work and the ability to make a big impact while working side-by-side with a team of fun, innovative people? Ideally, would you like this position to be with an organization that makes a positive contribution to the world? If so…we would love to hear from you! About Us University of Phoenix is a leading higher education institution founded in 1976 by Dr. John Sperling. Our mission is to improve the lives of our students, their families and future generations through higher education. Our values (which hopefully you share) are: Brave. Honest. Focused. Our University values and embraces all team members and their unique perspectives. We fundamentally believe in fostering an environment which deeply respects, celebrates, and actively encourages a diverse workforce. We are committed to hiring – and learning from – those who share our passion to help others achieve their educational aspirations. We offer excellent benefits, an effective recognition program, and outstanding learning and development tools, including tuition vouchers for employees and their qualified family members. About the Position An Associate Faculty primarily instructs undergraduate and/or graduate courses in specific disciplines in accordance with University of Phoenix learning objectives and course outlines, engaging with students to drive academic rigor and student success.  In addition to classroom instruction, an individual performs a variety of classroom-related and other activities, which are established by university leadership and/or dictated by specific course requirements, to ensure every student has the opportunity to learn, progress, and achieve academic success. Deliver course content, learning activities, and student assessments using the University’s current course materials. Share supplemental knowledge and experience to help students understand and make the connections between course concepts and real-world applications. Work efficiently and effectively to provide high quality instruction to university students in accordance with the standards in the University of Phoenix Faculty Handbook and all other applicable policies and procedures Ensure all class materials are made available to students on a timely basis to facilitate timely participation and relevant classroom instruction and discussion. Provide each student the opportunity to grow, develop, and achieve academic success by maintaining an engaged classroom presence, timely responding to student inquiries, and creating a supportive learning environment that empowers students to develop cognitive skills and confidence. Proactively address student academic issues in accordance with University policies and guidance. Perform a variety of additional duties, such as coaching, tutoring, and identifying appropriate additional resources, as determined by specific course and or program requirements that support student learning and success inside and outside of the classroom environment; oversee student clinical/practicum/mentorship experiences as required by the course and/or program, as applicable. Attend various faculty meetings and University events as required, including but not limited to General Faculty Meetings, Content Area Meetings, and student graduations. Maintain current knowledge of all applicable University course updates, instruction standards and other relevant information that contributes to associate faculty effectiveness and student engagement and achievement. Maintain current professional and technical knowledge of content area(s) through employment, professional certification/licensure, professional conference attendance/speaking engagements, professional publications, personal networks, professional organizations, and other viable means. Instruct and perform other job-related required duties in an online environment, as dictated by program requirements. Maintain an understanding of all applicable University technology and adapt to technology changes as needed to facilitate classes and maintain active faculty status. Perform other duties as assigned or apparent. NOTE:  The Primary Accountabilities above are intended to describe the general content and requirements of the position and are not intended to be an exhaustive statement of duties.  Incumbents may perform all or most of the Primary Accountabilities listed above.  Specific goals or responsibilities will be documented in incumbents’ performance objectives as outlined by the incumbents’ immediate manager. Supervisory Responsibility: None MINIMUM KNOWLEDGE, SKILLS, AND ABILITIES: **Must have experience with Women's Health practice experience ** Doctorate of Nursing Science, Doctor of Nursing Practice, a PhD in Nursing, or a Medical Physician degree including Naturopathic MD, Obstetrician and/or Gynecologist, and Doctor of Osteopathic Medicine OR Doctorate degree in any area and a Master’s degree in Nursing OR Master’s degree in Nursing A minimum of 5 years of applicable experience as a Nurse Practitioner (NP) and/or Certified Nurse Midwife (CNM), a minimum of 2 years experience within the last 5 years REQUIRED KNOWLEDGE, SKILLS, AND ABILITIES: Degree must be from a regionally accredited institution Must have the following active unencumbered or unrestricted Registered Arizona Nurse or Multistate (RN) license Arizona Advanced Practice Registered Nurse (APRN) certification National Certification as a Family or Women's Health Care or OBGYN Nurse Practitioner, or, Nurse Midwife NOTE: Medical Physicians only require a current unencumbered or unrestricted license to practice. Acceptable professional position is a Nurse Practitioner (NP), Certified Nurse Midwife (CNM), Medical Physician or DO with women’s health practice experience. CURRENCY: Must have 2 (two) years current experience within that last 5 years SCHOLARSHIP REQUIREMENT: All faculty members must have one record of scholarship annually, within a rolling one-year timeframe, that meets UOPX’s definition of scholarship engagement. Faculty who do not initially meet this requirement may still be qualified, however, they have one year from the date the content area is approved and/or the requirement effective date, to come into compliance with this Nursing Scholarship requirement to maintain content area approval. College of Nursing requires all faculty with approved courses within the College to maintain Annual Scholarship ADDITIONAL QUALIFICATIONS: Familiarity with adult education teaching and learning theory High level of problem solving and decision-making ability to assess student work, address issues and concerns,  and provide appropriate guidance Excellent oral and written communication and interpersonal skills to communicate effectively with diverse constituencies, including students, other faculty, staff, and external parties Technology proficiency, including Microsoft suite programs Able to convey a professional image and represent the University appropriately within the community and with external parties As an Equal Opportunity employer, we particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community. If you are an active-duty military member seeking employment when off-duty, compliance with Department of Defense Joint Ethics Regulation, 5500-7-R, is required prior to starting employment with University of Phoenix. You are advised to contact your base Judge Advocate General to seek such approval and answer any questions. Pay Range For all states except CA, the pay range for this position is on a per course basis, and is between $1,035 and $3,686. The hourly rate for this course in CA is: $31.25 Your work is critical to helping adult learners achieve their dreams, and we’re committed to rewarding you for your efforts. We offer benefits designed to help you meet your financial and educational goals. Associate faculty are eligible for: Participation in our 401(k) plan; and Competitive tuition assistance for you and eligible dependents. For more details around paid time off benefits, please click here . Application Deadline is 01/30/2026. Application Deadline 01/30/2026 < Back to search results Apply now Share this job: Share Facebook LinkedIn X Email Visit our Campus Safety page at https://www.phoenix.edu/about/campus-safety.html to download a copy of any UOPX location’s Annual Security Report for information regarding crime reporting; campus safety policies; crime statistics for the previous three calendar years for crimes which occurred on-campus, in certain noncampus buildings owned or controlled by the University, and on public property within or immediately adjacent to and accessible from each campus; crime, alcohol and drug use; sexual and interpersonal violence awareness and prevention programs; campus notification procedures such as timely warnings, and more. A paper copy of any UOPX location’s Annual Security Report will be provided upon request, and requests can be made by contacting any Campus Safety Coordinator or University representative. Copyright © 2026. All rights reserved. | EEO policy | EEO is the law | Privacy policy | Accommodations | Title IX information"
},
{
    "job_url": "https://epic.avature.net/Careers/FolderDetail/Verona-Wisconsin-United-States-Software-Developer-Intern-Summer-2027/30318",
    "description": "Software Developer Intern - Summer 2027 Position Summary As a software development intern at Epic, you'll take ownership of a meaningful and challenging project that will help shape the future of healthcare. You'll be mentored by brilliant colleagues, collaborate with fellow interns, and accomplish something that you can be proud of. We'll make sure you have the background and tools you need to succeed, but you'll hit the ground running and own your project in its entirety - from gaining an understanding of your users' needs to handling design, development, testing, and documentation. We'll give you a lot to do, and we'll expect you to deliver something great. The software we create directly improves the way 325 million patients around the world receive healthcare - in fact, it's likely that you'll be affecting the life of someone close to you. You'll need to take your work seriously, but that doesn't mean you'll have to take yourself too seriously (having fun is part of our mission). You'll find a rare combination of intellectually demanding and interesting projects that contribute to the greater good, allowing you to find true fulfillment in what you do. Live affordably in a city known for its rising tech talent. Epic is located just outside Madison, Wisconsin , the second fastest growing market for tech talent in the United States and home to the state capital and the University of Wisconsin. Madison, a city surrounded by water, has received accolades for being the greenest city in America (NerdWallet), the best city for renters (SmartAsset), the fittest city in America (Fitbit), and the third best metro in the US for young professionals (Forbes Advisor). More than just important work . Our uniquely themed campus was designed to heighten your ability to get stuff done in your office, a conference room, or by the fireplace in a comfy chair.  All meals are restaurant-quality but cost only a few dollars, and they’re prepared by a team comprised of kitchen talent from restaurants around the country.  And, after five years here, you’ll earn a four-week sabbatical anywhere in the world. Staff have kayaked in Patagonia, attended a Beyoncé concert in Ireland, built a library in Tanzania, and run a marathon in Antarctica. Healthcare is global, and building the best ideas from around the world into Epic software is a point of pride. As an Equal Opportunity Employer, we know that inclusive teams design software that supports the delivery of quality care for all patients, so diversity, equity, and inclusion are written into our principles.  Please see our full non-discrimination statement at https://careers.epic.com/EEO . Requirements Working toward a BS/BA (or combined BS/MS) in Computer Science, Software Engineering, or a related field Junior standing or greater and seeking full-time employment in the 2028 calendar year A history of academic success Eligible to work in the United States without visa sponsorship Relocation to the Madison, WI area for the duration of your internship COVID-19 vaccination Apply Now Keep looking"
},
{
    "job_url": "https://jackhenry.avature.net/careers/JobDetail/AI-Gateway-Operations-Coordinator/16588",
    "description": "At Jack Henry, we deliver technology solutions that are digitally transforming and empowering community banks and credit unions to provide enhanced and streamlined user experiences to their customers and members. Our best-in-class products are just the start as we lay the groundwork for the future of digital banking and payments. We hope you'll join us. We’re seeking an AI Gateway Operations Coordinator to join our team and enable our teams to leverage AI to make our products better. In this role, you will lead client engagement and operational support for our AI Gateway and agent platforms. Your initial focus will involve taking over setup and support for these tools, managing client provisioning, and handling access control to ensure a seamless onboarding experience. You will work closely with AI coaches, product teams on requirements, enterprise architecture, and infrastructure teams to support this GCP based system. This position may be worked remotely from of any of our office locations in Allen, TX; Lenexa, KS; Springfield, MO; Monett, MO; Birmingham, AL; Cedar Falls, IA; or Louisville, KY. May require occasional travel, up to 10% for meetings, trainings or conferences. All positions, regardless of location, may require an onsite interview or in-person onboarding requirement to verify your identity. What you’ll be responsible for: Consults internal and external groups by explaining product behaviors and introducing groups to integration options Creates integration examples for product groups working to integrate with Jack Henry's API services. Creates design documentation, educational material, and presentations. Acts as project lead on more standard integration solutions for JH internal teams, customers, or third-party integrators. Performs system analysis and programming activities, which may require extensive research and analysis. Provides technical/engineering support for new and existing applications from code delivery until the retirement of the application. Provides both individual and budget-level tasks and product effort estimates/costs. Creates required technical documentation. Adheres to documented departmental and corporate standards. Participates in the definition and documentation of standards. Collaboratively works with the customer support team to resolve or diagnose defects. Researches problems and develops solutions to the problems. Conducts unit testing and integration testing for functionality and limits. Performs other duties as assigned. What you’ll need to have: Minimum of 4 years of experience in IT operations, product support, and/or programming. Experience with AI tools, either as a user or working on projects/initiatives related to AI use. Experience managing cloud tools or infrastructure in either AWS, Azure, and/or GCP Experience with Python or a similar scripting language. Experience in a customer-facing technical support or implementation role. Strong communication skills with proven ability to clearly communicate complex technical topics and tailor messages to different stakeholder groups. What would be nice for you to have: Bachelor’s degree preferred. Experience with Datadog, Splunk, Dynatrace, or similar log analysis tools. Experience building AI tools and bots. Experience working within the SDLC. Experience deploying production code. If you got this far, we hope you're feeling excited about this opportunity. Even if you don't feel you meet every single requirement on this posting, we still encourage you to apply. We're eager to meet motivated people who align with Jack Henry's mission and can contribute to our company in a variety of ways. Why Jack Henry? At Jack Henry, we pride ourselves through our motto of, \"Do the right thing, do whatever it takes, and have fun.\" We recognize the value of our associates and believe much of our company's strength and success depends on their well-being. We demonstrate our commitment by offering outstanding benefit programs to ensure the physical, mental & financial well-being of our people is always met. Culture of Commitment Ask our associates why they love Jack Henry, and many will tell you it is because our culture is exceptional. We do great things together. Rising to meet challenges and seeking opportunities is part of who we are as an organization. Our culture has helped us stay strong through challenging times and we credit our dedicated associates for our success. Visit our Corporate Responsibility site to learn more about our culture and commitment to our people, customers, community, environment, and shareholders. Equal Employment Opportunity At Jack Henry, we know we are better together. We value, respect, and protect the uniqueness each of us brings. Innovation flourishes by including all voices and makes our business - and our society - stronger. Jack Henry is an equal opportunity employer and we are committed to providing equal opportunity in all of our employment practices, including selection, hiring, performance management, promotion, transfer, compensation, benefits, education, training, social, and recreational activities to all persons regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, genetic information, pregnancy, marital status, sex, gender, gender identity, gender expression, age, sexual orientation, and military and veteran status, or any other protected status protected by local, state or federal law. No one will be subject to, and Jack Henry prohibits, any form of discipline, reprisal, intimidation, or retaliation for good faith reports or complaints of discrimination of any kind, pursuing any discrimination claim, or cooperating in related investigations. Requests for full corporate job descriptions may be requested through the interview process at any time. #INDTech",
    "JobID": "16588",
    "Position Level": "Individual Contributor",
    "Team": "Information Technology",
    "Working Time": "Full-Time",
    "Position Type": "Regular",
    "Travel Requirements": "10%",
    "Workplace Type": "Hybrid",
    "Preferred Location": "Monett, MO",
    "Additional Locations": "Allen, TX, Birmingham, AL, Cedar Falls, IA, Lenexa, KS"
},
{
    "job_url": "https://dhlconsulting.avature.net/en_US/careers/JobDetail/Bonn-Nordrhein-Westfalen-Germany-Associate-Consultant-d-f-m-DHL-Consulting-Europe/450",
    "description": null,
    "Location:": "Bonn, Germany",
    "Job Seniority:": "Graduate, Young Professionals",
    "Job Type:": "Consulting",
    "Working time:": "Full-time",
    "Type of contract": "Permanent",
    "Travel extent": "Below 25%",
    "Requirements:": "As an equal opportunity employer, we welcome applications from everyone. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other protected characteristic. We recruit on a rolling basis and accept applications all year round. Feel free to apply at your earliest convenience. Possible starting dates are the first of each month (except December). To ensure that every application receives the attention it deserves, we kindly ask you to apply for only one position at a time. If we believe your profile is a better fit for another role or level, we will reach out to you directly. Please submit it in English, including your CV, academic, and high school records, and your reference letters (if applicable). Your point of contact is Samantha Dunkel. We are looking forward to your application! Contact us if you have any questions: dhlconsulting-careers@dhl.com"
},
{
    "job_url": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sourcer/12182",
    "description": "Sourcer Bangalore, India Job ID: 12182 As a Sourcer, you know that you need to come up with fresh ideas in order to drive candidate flow in the full lifecycle recruiting process. You also know that customer service is key to successfully supporting your customers and attracting top talent. Pontoon is looking for someone who can bring a new outlook to candidate attraction. As a part of the sourcing team, you will be tasked with communication and outreach to create a candidate funnel. Your top priority will be marketing to top talent and searching for ideal candidates for our clients. The ideal Sourcer is confident in data mining, social media campaigns, and advertisements. The Sourcer is a vital part of the talent acquisition process because they are our front line of defense when it comes to producing quality candidates for our clients.  Are you up for this task? What does a day in the life of a Pontoon Sourcer look like? Each role will require its own sourcing strategy, so it’s up to you to get creative with marketing content, including postings, email campaigns, and flyers! Being a job board and sourcing tool wizard as you leverage these platforms to post approved requisitions, identify and attract talent, and build your pipeline Developing research skills using Boolean searches and leveraging relevant media and communication channels Utilizing data and metrics to evaluate current initiatives, strategies, pipelines, tools, technologies, job boards, etc. and identify, recommend, and develop best practices Daily interaction with your recruiting team as well as hiring managers and candidates At Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive. So are looking for a company that not only caters to its clients but its employees as well? Then Pontoon is waiting for candidates like you! Click here to find out more. Apply Now"
},
{
    "job_url": "https://careers.loreal.com/en_US/jobs/JobDetail/L-OREAL-Taiwan-Assistant-Key-Account-Manager/225153",
    "description": null
},
{
    "job_url": "https://sandboxmgl.avature.net/en_US/careers/JobDetail?jobId=17544",
    "description": null,
    "Advertising offices": "Adelaide, Perth",
    "Job ID": "17544",
    "Date": "17-Oct-2025",
    "Job category": "Asset Management"
},
{
    "job_url": "https://monadelphous.avature.net/careersmelchor/FolderDetail/Formworkers-Locals-and-FIFO-3-1/258487",
    "description": "We’re looking for experienced Formworkers for upcoming civil construction projects located in Western Australia on a Local Short-Term project or a 3:1 FIFO roster. Melchor, part of the Monadelphous Group, is one of WA’s fastest growing civil construction contracting businesses, bringing a unique service offering to large resource-sector projects. For people joining us, that means the possibilities are endless. The ability to establish yourself in a rapidly expanding business, to be part of the team that sets the direction of the company, or on the ground as part of the team that solidifies our reputation for delivery. And perhaps best of all, the ability to contribute ideas in a company that is small enough for you to be heard, but big enough to be working on major resources projects. Why join us? Working with Melchor comes with a range of benefits, including: * Competitive remuneration (attractive EBA base rates + penalties + allowances) * Continual training and development opportunities * An employee perks scheme offering discounts on goods and services * The opportunity to join a growing business with industry leaders and make an impact What you’ll bring: * Perth point of hire only * Previous experience in the Civil Construction industry * Valid White Card * Tickets and/or Qualifications relevant to your trade * Commitment to safety in everything you do * Unlimited working rights in Australia About Us Monadelphous is an ASX-200 company providing multidisciplinary construction, maintenance and industrial services to many of the largest companies in the resources, energy and infrastructure sectors. Established in 1972, we’ve been working in Australia and around the world for more than 50 years. We work on the biggest projects and ensure our teams have a variety of opportunities available to follow their career path of choice. Our Engineering Construction division is an increasingly diverse business, focusing on managing and delivering large-scale project management and construction services. Our expertise includes civil construction, structural steel fabrication, modularisation and delivery, as well as structural, mechanical, piping and tank construction. We also specialise in heavy lift and haulage services, electrical and instrumentation work and renewable energy infrastructure. Within this division, Melchor is one of WA’s fastest-growing civil construction contractors, delivering a broad range of capabilities tailored to major resource-sector projects. Known for our focus on safety, quality and performance, we deliver complex works across the resources, infrastructure and industrial sectors. Safety is at the forefront of everything we do, and we live by our promise: The Safe Way is the Only Way. Apply now to get started. A career at Monadelphous is a career with a difference. Make it yours.",
    "Ref #": "300043049",
    "Region": "Perth, WA",
    "Classification": "Trades",
    "Date Posted": "09-Feb-2026"
},
{
    "job_url": "https://mercadona.avature.net/es_ES/Careers/JobDetail/Repartidor-a-para-supermercado/305787",
    "description": null,
    "Municipios con vacante disponibles": "Andratx, Calvià",
    "Tipo de contrato": "Fijo Discontinuo",
    "Qué te ofrecemos": "Formación remunerada Proyección laboral dentro de la empresa Horario conocido el día 20 del mes anterior",
    "Cómo será tu día a día": "Como repartidor/a de Mercadona, tus tareas serán preparar, revisar y cargar los pedidos en la furgoneta de reparto, conducir hasta el destino, descargar y entregar la compra en la casa o lugar de recepción indicado. En las horas que no haya repartos, también realizarás otras tareas de tienda. No te preocupes por la experiencia, la formación corre de nuestra cuenta."
},
{
    "job_url": "https://gpshospitality.avature.net/careers/JobDetail/Shift-leader/89420",
    "description": null
},
{
    "job_url": "https://ally.avature.net/careers/JobDetail/Account-Executive-F-I-Dealer-Products-Services-Greater-Nashville-TN-Sales-Market/15915",
    "description": "Candidate must reside in, or be willing to relocate to, the South-Central Kentucky or Central Tennessee area, preferably the Greater Nashville, TN or Bowling Green, KY area, requiring local travel throughout the surrounding Greater Nashville & Louisville sales market. Company vehicle provided. Successful account executives love to play. Creativity drives them – they throw new ideas against the wall and watch them stick. In this role, you’ll expand product offerings in existing business through cross-selling and increase market share with new clients. You’ll balance your compassion and empathy for everyone involved in the sales process. We see our account executives as problem solvers who are resilient, can face adversity, aren’t afraid of rejection and emerge as champions when times are tough. If you want flexibility, training to improve your skills and a management team that champions you and backs you up, Ally is the place to be.",
    "Career area": "Sales",
    "Work Location(s)": "KY, TN",
    "Remote?": "Yes",
    "Ref #": "21682",
    "Posted Date": "02-06-26",
    "Working time": "Full time"
},
{
    "job_url": "https://careers.slhs.org/careersmarketplace/JobDetail/Sourcing-Director-retirement/150626?source=External+Career+Site",
    "description": "At St. Luke’s, we pride ourselves on fostering a workplace culture that values diversity, promotes collaboration, and prioritizes employee well-being. Our commitment to excellence in patient care extends to creating an environment where our team can thrive both personally and professionally. With opportunities for growth, competitive benefits, and a supportive community of colleagues, St. Luke’s is truly a great place to work. The Sourcing Director - Supply Chain is responsible for developing the sourcing strategy and overseeing the purchasing of supplies to support the health system. This role will lead the strategic direction and execution of the supplier strategy to optimize cost, performance, and quality. What You Can Expect Manages all distribution service-related sourcing of product(s) moving in or through the distribution center along with the relationships with internal/external customers, Group Purchasing Organization (GPO) contracting and suppliers that make up the supply base. Leads supply sourcing activities across procurement expenditure categories. Leads cross-functional sourcing team to establish, develop and implement multiple high complexity strategies. Leads sourcing and procurement key performance indicators (KPI) reporting and leverages expertise to communicate short-and long-term strategy to executive leadership. Creates and oversees implementation of KPIs to ensure savings and lower cost of goods. Subject matter expert for supply chain requirements to include regulatory, supplier capabilities and categorical decision making. Manages high level supplier relationships and performance expectations. Develops key performance measures for suppliers and negotiates on multiple variables to establish longer-term strategic contracts. Partners with appropriate internal leadership to ensure the Logistics Services Agreement is accurate and incorporated for all Consolidated Service Center suppliers. Creates, implements, and maintains a sourcing and supplier management strategy by profiling current expenditures, understanding of group purchasing contracts, understanding of contracts in the marketplace, analyzing the distribution and logistics impact on supplier/product pricing. With expert knowledge, oversees a variety of implications when bringing on a new supplier including but not limited to how the contractual obligations affect demand/supply and strategic bulk purchases. Manages a team of sourcing managers responsible for executing all sourcing activities including request for proposals (RFPs), competitive auctions and maintaining supplier performance. Responsible for full employment life cycle for staff to include hiring, termination, performance management, coaching, training, and mentoring to staff. Performs other duties as assigned. Qualifications Education: Bachelor's degree or experience in lieu of degree. Experience: Ten (10) years' relevant experience.",
    "Department": "CSC Support Service Center",
    "Position Type": "Full-Time",
    "Shift": "Day",
    "Job ID": "150626",
    "City": "Meridian",
    "State": "ID",
    "Category": "Supply Chain",
    "Remote": "Hybrid"
},
{
    "job_url": "https://astellasjapan.avature.net/en_GB/careers/JobDetail/Asc-BioPharma-Manufacturing/3676",
    "description": null
},
{
    "job_url": "https://careers.mantech.com/en_US/careers/JobDetail/Imagery-Analyst/62202",
    "description": "Unlock the secrets of intelligence with MANTECH! Join a dynamic team at the forefront of national security, providing advanced solutions to government intelligence agencies. Since 1968, we’ve been solving the toughest challenges with groundbreaking tech. Explore thrilling projects in Digital Transformation, Cybersecurity, IT, Data Analytics and Software Development. Elevate your career and make a difference. Your adventure begins now—unleash your potential with MANTECH! MANTECH seeks a mission-focused Imagery Analyst to support intelligence operations across the Asia Pacific region in Springfield, VA. This role supports national security objectives by conducting detailed imagery research and analysis using current and historical softcopy imagery, multi-INT sources, and geospatial tools. You will work closely with fellow imagery analysts and Data Scientists to exploit, identify, monitor, and assess dynamic events, emerging trends, and complex intelligence problems, producing high-quality, imagery-derived intelligence products that inform operational and strategic decision-making. Responsibilities include but are not limited to: In this role, you will apply imagery and geospatial expertise to support customer requirements and deliver actionable intelligence products. Perform imagery research and analysis of Asia Pacific locations using current and historical softcopy imagery. Research and utilize appropriate databases to amplify imagery-derived information and support analytic assessments. Obtain and exploit softcopy and commercial imagery-related products in response to customer needs. Utilize imagery, multi-INT, and other customer data repositories to identify, monitor, and analyze existing and emerging trends and dynamic events. Apply the full suite of imagery analysis tools and geospatial information systems to solve intelligence problems. Analyze underground facilities and apply geospatial techniques to support imagery-derived intelligence production. Produce finished intelligence products, reports, and assessments derived from imagery analysis. Collaborate regularly with other imagery analysts, Data Scientists, and mission partners to support integrated analytic efforts. Support intelligence collection by applying knowledge of overhead intelligence collection systems and contributing to tasking efforts as required. Minimum Qualifications: 3+ years of intelligence analysis experience within the Intelligence Community or military commands at the national and tactical levels. Completed an imagery analysis curriculum through the U.S. Military or the Intelligence Community. Working knowledge of imagery and geospatial systems and software, including RemoteView, Socet GXP, ERDAS Imagine, and ArcGIS. Knowledge of Intelligence Community and Department of Defense reporting standards, with demonstrated ability to collaborate effectively across Intelligence and Defense organizations. Demonstrated experience collaborating with national and service intelligence agencies and centers. Demonstrated ability to conduct spatial and temporal analysis of OSINT, HUMINT, and SIGINT reporting in support of GEOINT analysis. Knowledge of overhead intelligence collection systems, including overhead, air-breather, and civil or commercial platforms. Working knowledge of systems and tools such as Intelink, SAFE and or M3, RemoteView, CEDALION, and IEC. Preferred Qualifications: Demonstrated strong oral and written communication skills, including the ability to present and discuss technical and procedural aspects of imagery software. In-depth imagery analysis experience across multiple Areas of Interest within the Asia Pacific region. Experience analyzing patterns of life, economic stability, and import and export activities through imagery analysis. Experience collaborating with the Office of Naval Intelligence on assigned Areas of Interest. Experience collaborating with MGAP partners, including answering analytic questions and providing subject matter insight. Experience attending partner meetings as an subject matter expert for a branch or mission area. Experience creating initial analytic baselines for known Areas of Interest with direct mission impact. Experience developing and authoring intelligence products aligned with Presidential Intelligence Priorities and standing collection requirements. Clearance Requirements: An active TS/SCI clearance with the ability to obtain and maintain a polygraph Physical Requirements: Must be able to remain in a stationary position for extended periods while performing imagery analysis and reporting. Must be able to occasionally move about the work area to collaborate with team members and access mission systems. Must be able to communicate effectively with co-workers, management, and customers to exchange accurate information and present analytic findings. MANTECH International Corporation considers all qualified applicants for employment without regard to disability or veteran status or any other status protected under any federal, state, or local law or regulation. If you need a reasonable accommodation to apply for a position with MANTECH, please email us at careers@mantech.com and provide your name and contact information.",
    "Requisition #": "R65822",
    "Locations": "USA-VA-Springfield",
    "Posting Date": "02/06/2026",
    "Security Clearance Required": "TS/SCI",
    "Remote Type": "Onsite",
    "Time Type": "Full time"
},
{
    "job_url": "https://a2milkkf.avature.net/careers/JobDetail/Supply-Chain-Coordinator/377",
    "description": null,
    "Job Title": "Supply Chain Coordinator",
    "Location": "New Zealand - Auckland",
    "Date Published": "Wednesday, February 4, 2026",
    "Ref #": "365",
    "Work Type": "Permanent",
    "Business Unit": "Supply Chain & Operations"
},
{
    "job_url": "https://stagingkoch.avature.net/en_US/examplePathName/JobDetail/Engineer-Process-TT-Demo-11142025/163607",
    "description": null,
    "Location(s)": "Beijing, Beijing | ChengDu, Sichuan, Sichuan | Shanghai, Shanghai",
    "Company": "Koch",
    "Career Field": "Operations & Manufacturing",
    "Job Number": "163607"
},
{
    "job_url": "https://traderjoes.avature.net/careers/JobDetail/Crew/19860",
    "description": "Location: #554 - 1280 West Broadway Job Location City Hewlett Job Location State New York Job Location Zip Code 11557 Job Type: Crew Starting Pay Rate: $18.00 -  / hour Hours: Up to 38 Desired Shifts: Monday Tuesday Wednesday Thursday Friday Saturday Sunday All Day All Day All Day All Day All Day All Day All Day Is it you? Our Crew Members create a warm and friendly shopping experience in our stores.  We answer questions, offer suggestions, and ensure our customers know they are welcomed and cared for.  We entertain customers and make grocery shopping an exciting adventure. Some responsibilities may include: Working on teams to accomplish goals Operating the cash register in a fun and efficient      manner Bagging groceries with care Stocking shelves Creating signage to inform and delight customers Helping customers find their favorite products You'll learn a lot. You're not stuck doing one task here. Each Crew Member contributes to creating a WOW customer experience by participating in all aspects of the job. If you have experience in art including penmanship, working with chalk, and large signage, that's a plus. If you have a passion for people and a fervor for food, we'd love to meet you.  We can teach you the rest. Stores have the greatest need for people that can work evenings and weekends. Trader Joe's is an equal-opportunity employer and is committed to hiring a diverse Crew."
},
{
    "job_url": "https://ikea.avature.net/en_US/External/JobDetail/Employ-Restauration-F-H-CDI-Temps-Partiel-id-al-tudiant/327831",
    "description": null
},
{
    "job_url": "https://mycareer.hsbc.com/en_GB/external/PipelineDetail/Trustee-Supervisor/288167",
    "description": null,
    "Job ID": "288167",
    "Location": "Republic Of Ireland",
    "Area of interest": "Securities and Broking Services",
    "Job type": "Permanent - Full Time",
    "Work style": "Hybrid Working",
    "Opening date": "04-Feb-2026",
    "Closing date": "18-Feb-2026",
    "Job Advert Details": "At HSBC Ireland, our purpose is opening up a world of opportunity and by joining our team, you can be part of something bigger. We are committed to removing barriers and ensuring careers at HSBC are inclusive and accessible. What you will do: Supervision of the Analysts, ensuring internal deadlines are met and agreed procedures followed to ensure that all clients are operating in accordance with the Central Bank of Irelands’ UCITS & AIFM Regulations and in accordance to the restrictions as detailed in the schemes’ documentation. In this role you will: Assist in the management of developmental activity for team members and manage their work schedules to ensure optimum coverage for stakeholders. Assist to achieve continuous improvements in efficiency of service provision and cost effectiveness of operations. Ensure that all clients are operating in accordance with the Central Bank of Irelands’ UCITS & AIFM Regulations. Ensure a high standard of work from the offshore locations, ongoing training of the staff there and strong KPIs being achieved from them. Adhere to KPI’s by ensuring deadlines are met, SLD’s adhered to, and procedures followed with 100% success rate. Be responsible, in particular, for the work of the offshore location- Accuracy, Timeliness and Efficiency. You should apply if you have: Appropriate experience in a funds’ environment. Good technical knowledge of key duties and responsibilities of trustee Specialist certificate in Investment Fund Services an advantage. Previous supervisory experience is desirable given the dimensions of the role Solid understanding of financial instruments, stock markets and derivatives. Excellent numeric and analytical skills with strong attention to detail Accounting or legal qualification preferred Even if you feel you do not meet 100% of our qualifications, we encourage you to apply, if you believe this role is right for you. What you’ll get in return: Not only is HSBC a great place to work, but we also offer the following unique and exciting opportunities and benefits: We’ll help you progress your career, including access to development programmes, mentoring and coaching, as well as world-class training through HSBC University You can work your way and will have a say in when, where and how you and your team flexibly work together We’ll give you a huge range of resources that support your mental, physical and social well-being, including Employee Assistance Program You’ll have opportunities to work internationally - this can be your place to start and branch out to anywhere we have offices You’ll be able to join our Employee Resource Groups that bring together colleagues with shared characteristics and common interests. Being open to different points of view is important for our business and the communities we serve. At HSBC, we’re dedicated to creating diverse and inclusive workplaces. We are committed to removing barriers and ensuring careers at HSBC are inclusive and accessible for everyone to be at their best. If you have a need that requires accommodations or changes during the recruitment process, please let us know. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website. For further information on building your career at HSBC, please visit: www.hsbc.com/careers"
},
{
    "job_url": "https://cyclecarriage.avature.net/careers/JobDetail/Singapore-Automotive-Technician/476",
    "description": "Country Singapore Job Description Joining C&C is a distinctive opportunity to develop your career within a successful organization where everyone respects each other and enjoys working together. We recognize your performance in both tangible and intangible ways, by providing you development opportunities and making you feel respected. The Opportunity As a technician with Cycle & Carriage Singapore, you will be responsible for providing installation, testing, maintenance and repair jobs that comply with customers’ requirements and manufacturers’ specifications. • Carry out maintenance service and repair job, and report any other defects found during the course of repair • Able to perform electrical installation jobs and troubleshooting/ rectification of installation problems • Able to carry out medium to complex diagnostics works as assigned by Superior • To be accountable for all parts or materials used; as well as customers’ vehicle and belongings during the process of repair • Carry out optimum quality check on all vehicles before delivery • Ensure all vehicles are road worthy within manufacturer standard & specification • Complies to all rules and regulations stipulated by the company on general code of conduct and safety Job Requirements Requirements: •\tA minimum qualification of NITEC in Automotive Technology or related discipline • 1 year of relevant experience in automotive service and repair •\tPossess a valid Class 3 driving license •\tBasic command of English (both verbal and written) •\tTeam player with initiative and a positive attitude towards learning Interested candidates may whatsapp their resume to +65 64707385 ! About the Company A member of the Jardine Cycle & Carriage Group, C&C is one of the leading automotive groups in Singapore. We started out in 1899 as a trader in nutmegs and other sundries. In more than 100 years since, we have grown to become a major player in the automotive industry in Singapore, retailing Mercedes-Benz, Mitsubishi, Kia and Citroën passenger cars and commercial vehicles. At Cycle & Carriage, it is more than just the recognition we have earned as being the leader in its class. \"Exceptional Journeys\" encapsulates our passion for our existence. Bringing together high-performing team members and technical excellence to create people-focused experiences that consistently exceed expectations. Whether it is a customer we serve, an employee that we engage, a brand that we carry, we want to support them in creating exceptional journeys for themselves. We have a constant mission to strive towards being an Employer of Choice in the countries we operate in. Some of our better performing countries have consistently being recognised for commendable people practices such as: HR Asia’s Best Companies to Work Platinum Award in 2025 (11th consecutive year winner) Happiest Workplace Award 2024 Finalist in HR Excellence Awards 2016 for Recruitment and Leadership Development; Winner of Innovative Talent Acquisition Strategy Award in the Annual Jardine Matheson HR Conference 2016 Winner of Excellence In Innovative Use of HR Technology in HR Excellence Awards 2017 Merit for Singapore Health Award as awarded by Health Promotion Board Jardine Matheson HR Conference 2017, where we clinched the Best Employer Brand, Best Work-Life Balance and Best HR Team Awards. Jardine Matheson HR Conference 2018 for Excellence in Employee Transformation Bronze Award in HR Excellence Award 2019 for Excellence in HR Innovation The emphasis on employee experience has been on the forefront of the C&C’s people practices. Keen for a career conversation? Connect with us to find out more. (You would be notified if you are shortlisted. By submitting your application, you consent to the collection, use and disclosure of your personal data contained in this document by Jardine Cycle & Carriage Limited and its subsidiaries and affiliates, for assessing your career application).",
    "Name": "Automotive Technician 汽车技术员",
    "Ref #": "296",
    "Date": "Tuesday, January 27, 2026",
    "Country": "Singapore",
    "Job Description": "Joining C&C is a distinctive opportunity to develop your career within a successful organization where everyone respects each other and enjoys working together. We recognize your performance in both tangible and intangible ways, by providing you development opportunities and making you feel respected. The Opportunity As a technician with Cycle & Carriage Singapore, you will be responsible for providing installation, testing, maintenance and repair jobs that comply with customers’ requirements and manufacturers’ specifications. • Carry out maintenance service and repair job, and report any other defects found during the course of repair • Able to perform electrical installation jobs and troubleshooting/ rectification of installation problems • Able to carry out medium to complex diagnostics works as assigned by Superior • To be accountable for all parts or materials used; as well as customers’ vehicle and belongings during the process of repair • Carry out optimum quality check on all vehicles before delivery • Ensure all vehicles are road worthy within manufacturer standard & specification • Complies to all rules and regulations stipulated by the company on general code of conduct and safety",
    "Job Requirements": "Requirements: •\tA minimum qualification of NITEC in Automotive Technology or related discipline • 1 year of relevant experience in automotive service and repair •\tPossess a valid Class 3 driving license •\tBasic command of English (both verbal and written) •\tTeam player with initiative and a positive attitude towards learning Interested candidates may whatsapp their resume to +65 64707385 ! About the Company A member of the Jardine Cycle & Carriage Group, C&C is one of the leading automotive groups in Singapore. We started out in 1899 as a trader in nutmegs and other sundries. In more than 100 years since, we have grown to become a major player in the automotive industry in Singapore, retailing Mercedes-Benz, Mitsubishi, Kia and Citroën passenger cars and commercial vehicles. At Cycle & Carriage, it is more than just the recognition we have earned as being the leader in its class. \"Exceptional Journeys\" encapsulates our passion for our existence. Bringing together high-performing team members and technical excellence to create people-focused experiences that consistently exceed expectations. Whether it is a customer we serve, an employee that we engage, a brand that we carry, we want to support them in creating exceptional journeys for themselves. We have a constant mission to strive towards being an Employer of Choice in the countries we operate in. Some of our better performing countries have consistently being recognised for commendable people practices such as: HR Asia’s Best Companies to Work Platinum Award in 2025 (11th consecutive year winner) Happiest Workplace Award 2024 Finalist in HR Excellence Awards 2016 for Recruitment and Leadership Development; Winner of Innovative Talent Acquisition Strategy Award in the Annual Jardine Matheson HR Conference 2016 Winner of Excellence In Innovative Use of HR Technology in HR Excellence Awards 2017 Merit for Singapore Health Award as awarded by Health Promotion Board Jardine Matheson HR Conference 2017, where we clinched the Best Employer Brand, Best Work-Life Balance and Best HR Team Awards. Jardine Matheson HR Conference 2018 for Excellence in Employee Transformation Bronze Award in HR Excellence Award 2019 for Excellence in HR Innovation The emphasis on employee experience has been on the forefront of the C&C’s people practices. Keen for a career conversation? Connect with us to find out more. (You would be notified if you are shortlisted. By submitting your application, you consent to the collection, use and disclosure of your personal data contained in this document by Jardine Cycle & Carriage Limited and its subsidiaries and affiliates, for assessing your career application)."
},
{
    "job_url": "https://radpartners.avature.net/careers/JobDetail/Remote-United-States-All-Remote-7-Evenings-on-14-Evenings-off-General-Radiologist-Neuroradiology-Preferred-Matrix-at-Radiology-Partners/18116",
    "description": "Position Description & Requirements POSITION SUMMARY Up to $100k commencement bonus Up to 20% neuro studies 100% remote position with the support of a remote team Small practice culture of collaboration and camaraderie, backed by the support of national resources Robust compensation package to include: Increased compensation model with uncapped earning potential. Increased wRVU value for XR Medical, dental and vision 401k and other investment opportunities Partnership and profit sharing 7on/14off (4pm-2am CST) with the additional moonlighting opportunities. Short path to partnership 24/7 worklist specialists and state-of-the art AI tools – spend your time reading The CORE team supports us by managing urgent calls, coordinating with doctors, and resolving image issues, letting us focus on our core tasks PRATICE OVERVIEW WITH MATRIX Matrix is the premier, internal teleradiology practice for the leading radiology group in the nation. We stand at the forefront of radiology groups nationwide, embodying a fusion of excellence and empowerment. Join us in redefining the future of radiological innovation. Get to know our practice! https://www.ra d partners.com/m atrix/ DESIRED PROFESSIONAL SKILLS AND EXPERIENCE Neuro experience preferred Fellows and residents welcome to apply Board eligible or certified by American Board of Radiology or the American Osteopathic Board of Radiology The ideal candidate will be comfortable reading all areas of DX Radiology with a focus on Acute Care Radiology (Emergency Room, ICU, Trauma, etc.) Candidates must be a Doctor of Medicine or Osteopathy and have residency trained in the practice of Diagnostic Radiology COMPENSATION: The salary range for this position is $425,000-$800,000. Final determinations may vary based on several factors including but not limited to education, work experience, certifications, geographic location etc. This role is also eligible for an annual discretionary bonus. In addition to this range, Radiology Partners offers competitive total rewards packages, which include health & wellness coverage options, 401k benefits, and a broad range of other benefits such as family planning and telehealth (all benefits are subject to eligibility requirements). FOR MORE INFORMATION OR TO APPLY: For inquiries about this position, please contact Marrah Perry at recruiting@radpartners.com or 315-879-5077. RADIOLOGY PARTNERS OVERVIEW Radiology Partners, through its affiliated practices, is a leading radiology practice in the U.S., serving hospitals and other healthcare facilities across the nation. As a physician-led and physician-owne d practice, we advance our bold mission by innovating across clinical value, technology, service and economics, while elevating the role of radiology and radiologists in healthcare. Using a proven healthcare services model, Radiology Partners provides consistent, high-quality care to patients, while delivering enhanced value to the hospitals, clinics, imaging centers and referring physicians we serve. Radiology Partners is an equal opportunity employer. RP is committed to being an inclusive, safe and welcoming environment where everyone has equal access and equitable resources to reach their full potential. We are united by our Mission to Transform Radiology and in turn have an important impact on the patients we serve and the healthcare system overall. We hold that diversity is a key source of strength from which we will build a practice culture that is inclusive for all. Our goal is to empower and engage the voice of every teammate to promote awareness, compassion and a healthy respect for differences. Radiology Partners participates in E-verify . CCPA Notice: When you submit a job application or resume, you are providing the Practice with the following categories of personal information that the Practice will use for the purpose of evaluating your candidacy for employment: (1) Personal Identifiers; and (2) Education and Employment History. Beware of Fraudulent Messages: Radiology Partners will never request payment, banking, financial or personal information such as a driver’s license in exchange for interviews or as part of the hiring process. Additionally, we will not send checks for deposit into your bank account at any stage of recruitment. All communication during the interview and hiring process should come from an email address ending in “@radpartners.com.” If you suspect you are receiving a fraudulent job offer or solicitation from Radiology Partners or one of our local practices, please notify our Recruiting Team at recruiting@radpartners.com .",
    "Job Title": "All Remote 7 Evenings on / 14 Evenings off General Radiologist, Neuroradiology Preferred  - Matrix at Radiology Partners",
    "Functional Area": "Clinical - Neuroradiology",
    "City": "Remote",
    "Work Location Type": "Remote",
    "State": "Remote",
    "Employment Type": "Full-time (30+ hrs/week)/FULLTIME",
    "Position Description & Requirements": "POSITION SUMMARY Up to $100k commencement bonus Up to 20% neuro studies 100% remote position with the support of a remote team Small practice culture of collaboration and camaraderie, backed by the support of national resources Robust compensation package to include: Increased compensation model with uncapped earning potential. Increased wRVU value for XR Medical, dental and vision 401k and other investment opportunities Partnership and profit sharing 7on/14off (4pm-2am CST) with the additional moonlighting opportunities. Short path to partnership 24/7 worklist specialists and state-of-the art AI tools – spend your time reading The CORE team supports us by managing urgent calls, coordinating with doctors, and resolving image issues, letting us focus on our core tasks PRATICE OVERVIEW WITH MATRIX Matrix is the premier, internal teleradiology practice for the leading radiology group in the nation. We stand at the forefront of radiology groups nationwide, embodying a fusion of excellence and empowerment. Join us in redefining the future of radiological innovation. Get to know our practice! https://www.ra d partners.com/m atrix/ DESIRED PROFESSIONAL SKILLS AND EXPERIENCE Neuro experience preferred Fellows and residents welcome to apply Board eligible or certified by American Board of Radiology or the American Osteopathic Board of Radiology The ideal candidate will be comfortable reading all areas of DX Radiology with a focus on Acute Care Radiology (Emergency Room, ICU, Trauma, etc.) Candidates must be a Doctor of Medicine or Osteopathy and have residency trained in the practice of Diagnostic Radiology COMPENSATION: The salary range for this position is $425,000-$800,000. Final determinations may vary based on several factors including but not limited to education, work experience, certifications, geographic location etc. This role is also eligible for an annual discretionary bonus. In addition to this range, Radiology Partners offers competitive total rewards packages, which include health & wellness coverage options, 401k benefits, and a broad range of other benefits such as family planning and telehealth (all benefits are subject to eligibility requirements). FOR MORE INFORMATION OR TO APPLY: For inquiries about this position, please contact Marrah Perry at recruiting@radpartners.com or 315-879-5077. RADIOLOGY PARTNERS OVERVIEW Radiology Partners, through its affiliated practices, is a leading radiology practice in the U.S., serving hospitals and other healthcare facilities across the nation. As a physician-led and physician-owne d practice, we advance our bold mission by innovating across clinical value, technology, service and economics, while elevating the role of radiology and radiologists in healthcare. Using a proven healthcare services model, Radiology Partners provides consistent, high-quality care to patients, while delivering enhanced value to the hospitals, clinics, imaging centers and referring physicians we serve. Radiology Partners is an equal opportunity employer. RP is committed to being an inclusive, safe and welcoming environment where everyone has equal access and equitable resources to reach their full potential. We are united by our Mission to Transform Radiology and in turn have an important impact on the patients we serve and the healthcare system overall. We hold that diversity is a key source of strength from which we will build a practice culture that is inclusive for all. Our goal is to empower and engage the voice of every teammate to promote awareness, compassion and a healthy respect for differences. Radiology Partners participates in E-verify . CCPA Notice: When you submit a job application or resume, you are providing the Practice with the following categories of personal information that the Practice will use for the purpose of evaluating your candidacy for employment: (1) Personal Identifiers; and (2) Education and Employment History. Beware of Fraudulent Messages: Radiology Partners will never request payment, banking, financial or personal information such as a driver’s license in exchange for interviews or as part of the hiring process. Additionally, we will not send checks for deposit into your bank account at any stage of recruitment. All communication during the interview and hiring process should come from an email address ending in “@radpartners.com.” If you suspect you are receiving a fraudulent job offer or solicitation from Radiology Partners or one of our local practices, please notify our Recruiting Team at recruiting@radpartners.com ."
},
{
    "job_url": "https://resourcebank.avature.net/careers/JobDetail/Chalgrove-Denholm-United-Kingdom-of-Great-Britain-and-Northern-Ireland-Martin-Baker-opportunities/29152",
    "description": "< Back to job list Martin-Baker opportunities Martin-Baker Chalgrove & Denholm, United Kingdom of Great Britain and Northern Ireland Ref#: 147135 Ready to Make a Real Impact? So Are We. At Martin-Baker, we’re driven by innovation, precision, and a commitment to saving lives. If you're passionate about solving complex challenges, eager to grow your skills, and want to be part of a world-leading engineering company, we want to hear from you. As a global leader in the design and manufacture of ejection and crashworthy seats, we know that our success is built on the talent and dedication of our people. That’s why we invest in your development, offering structured training, career progression opportunities, and a supportive environment where your ideas matter. In return, we offer a competitive bonus scheme and a comprehensive benefits package, including: Highly competitive non-contributory pension Health Cashback Plan Retail and Lifestyle Discounts And more... If you're ready to take the next step in your career, give us a call on 01952 212574 — our team is happy to talk you through the opportunities available. Or, simply upload your CV here and we’ll be in touch. Martin-Baker – Engineering Excellence. Saving Lives. Apply Now Share with: Facebook Twitter"
},
{
    "job_url": "https://careers.tesco.com/en_GB/careersmarketplace/JobDetail/Customer-Assistant/167763",
    "description": null,
    "About the role": "We pride ourselves on offering customers the biggest range of products around. And that's not just food, but everything from clothes and kettles to financial services. But did you know we offer the biggest job opportunities too? With stores across the UK and Ireland, and a variety of roles, we are always looking for people who are as passionate about helping customers as we are. Our Every Little Helps approach doesn't just apply to our customers. It's at the very heart of everything we do at work â€“ and it's what makes us different. We believe in treating each other with respect, and everyone having the opportunity to get on. That's what makes Tesco such a great place to work Should you be successful in your application, your offer will be subject to and conditional upon you providing your bank account details before your agreed start date.",
    "What is in it for you": "We offer excellent benefits that help make Tesco a great place to work.Â These include but arenâ€™t limited to: Competitive Salary Bonus Scheme* Our Virtual GP service provides free and confidential access to an online GP through video GP consultations, and online prescription service for colleagues. The service is also available to families of colleagues who live at the same address for a reduced cost. 24/7 access to our Employee Assistance Programme (EAP) for you and family members for in the moment emotional support along with free access to a range of wellbeing services supporting you under our new Wellbeing First approach of Body, Mind and Life. Colleague Clubcard offering 10% discount across stores and online, with 15% discount weekends once a month (Friday to Sunday), and 20% off twice a year. There is also 20% off F&F clothing, all year long, these various discounts can be extended to a family member with a 2 nd Clubcard available.* Life Assurance Pension Scheme* Save As You Earn Scheme* Paid Family Leave Bike to Work Long Service Awards Commuter Scheme *Entry requirements and rules of the scheme apply Â",
    "You will be responsible for": "Always put the customer first and consider them in everything you do. Get to know your customers and serve them with pride. Help to ensure products and services are available for customers at all times. Handle all products with care to maintain quality and ensure they reach the customer in the best condition. Keep the shop floor and back areas clean and tidy at all times. Â Using the training you receive, follow department routines and processes. Follow all company policies and adhere to Health and Safety routines. Whilst you will have a core role, you may be asked to support your colleagues by helping in other departments.",
    "You will need": "Able to give great, natural customer service by proactively smiling, greeting, acknowledging and helping customers. Works hard for customers, your team and your department. You are able to prioritise to ensure anything you do is right for our customers. Adaptable and resilient to meet the ever changing demands of our business. You must be able to follow instructions either verbal or written. You are reliable and a good timekeeper. You must be smart and tidy at all times.",
    "About us": "Our vision at Tesco is to become every customerâ€™s favourite way to shop, whether they are at home or out on the move. Â Our core purpose is â€œServing our customers, communities and planet a little better every dayâ€. Â Serving means more than a transactional relationship with our customers. Â It means acting as a responsible and sustainable business for all stakeholders, for the communities we are part of, and for the planet. Through initiatives like the Tesco Community Fund, our association with Childrenâ€™s Health Foundation, our partnership with FoodCloud and our Stronger Starts programme, we have supported over 21,000 community groups, raised over â‚¬7.5 million for medical equipment, and provided almost 15 million meals nationwide, to those living in food insecurity. Tesco has operated in the Irish retail market since 1997, and with 170 stores nationwide, we employ over 13,000 people in cities and towns around Ireland, supporting almost 45,000 jobs directly and indirectly. We partner with over 500 Irish suppliers - of which almost three-quarters are small and medium enterprises - which in turn supports almost 13,000 farming families around Ireland. Tesco is the single largest buyer of Irish food and drink in the world, buying â‚¬1.6 Billion a year; more than any other single country in the European Union, more than even the USA which you perceive as a massive buyer of Irish food. Â We work closely with suppliers across Ireland who are dedicated to making the best products for our customers and this is reflected in the numerous awards our products have won over the years including BlÃ¡s Na hÃ‰ireann, World Steak Challenge and Great Taste Awards. We are proud to have an inclusive culture at Tesco where everyone truly feels able to be themselves. It is embedded in our values: we treat people how they want to be treated. Â  At Tesco, we not only celebrate diversity, but recognise the value and opportunity it brings. Â We always want our colleagues to feel they can be themselves at work and we are committed to helping them be at their best. We know life looks a little different for each of us. Thatâ€™s why at Tesco, we always welcome chats about flexible working. Some people are at the start of their careers, some want the freedom to do the things they love. Others are going through life-changing moments like becoming a carer, nearing retirement, adapting to parenthood, or something else. So, talk to us throughout your application about how we can support. Tesco is committed to celebrating diversity and everyone is welcome at Tesco. We're committed to providing a fully inclusive recruitment process, allowing candidates the opportunity to thrive and inform us of any reasonable adjustments they may require. For further information on the accessibility support we can offer, please click http://roi.tesco-careers.com/accessibility/ How can I let Tesco know I need additional support? Please let us know you need additional support by emailing tescoireland.recruitment@tesco.ie This will allow us to understand more about you and how we can best support you through the recruitment process."
},
{
    "job_url": "https://jobs.auspost.com.au/en_GB/careers/JobDetail/St-Leonards-New-South-Wales-Australia-Trainee-Postie-St-Leonards/34256",
    "description": "No Motorcycle licence or no Motorcycle experience? No worries. Rider Academy is your pathway to becoming a Postie with full training, support and a clear path to getting your full motorcycle licence. This is a unique opportunity for passionate and motivated individuals to start their careers with Australia Post. Whether you're wrapping up school, exploring a new path, or returning to work – and if you're planning to get your motorcycle licence or already have your L’s — this is your chance to kickstart a career with real growth and long-term potential. Your New Role – Postie with a Purpose Your home base will be St Leonards on an ongoing basis, where you’ll complete all training and day‑to‑day duties. Once you’ve successfully gained your P’s, we’ll continue to support you in developing your skills, and if future opportunities arise that better align with your lifestyle, we can discuss them together. As a Postie, you’ll be delivering on our electric delivery vehicles or motorcycles as the friendly face of our trusted service. At the heart of your community, you'll connect Australians every day and make a real impact — all while developing your skills and shaping your future. What makes this opportunity different? Got your L's already? Great! Don't have your learners just yet? No worries! If you’re successful, we will guide you on how to get them before you start and will reimburse the cost as part of our Rider Academy program! While training, you will gain experience across other roles such as walking or electric–bicycle delivery until you’re licensed. You’ll be matched with a Rider Mentor and a supportive team, to back you every step of the way. Join to ride, stay to progress your career - if you have leadership ambitions, we'll support your long-term development towards them. All applicants encouraged to apply! Be part of our balanced, diverse and inclusive team of riders. You’ll Be: Starting early in the morning, sorting mail and small parcels with your teammates! Performing daily safety checks on your vehicle. Delivering mail and parcels on your bike/vehicle,rainor shine, to homes and businesses. Flexible to work across multiple sites as needed. Learning, growing, and making your mark with ongoing mentoring and leadership development! What You’ll Need: A passion for learning and a strong sense of commitment. Willing to complete licensing with our support. Must be able to pass the Pre-Learner Course for geared motorcycles. Physical fitness to lift upto 16kg regularly and meet our safe working vehicle load limit of weighing under 100kgs fully clothed (including helmet) Commitment to working Monday to Friday commencing 6am, with flexibility on finishing times is required. There are a limited number of part-time positions available. Successful candidates will be required to attend a mandatory three-day, in-person induction and training session in Villawood. How We’ll Deliver for You: Pay rate for this role is $32.34ph for the first 3 months, then $36.99ph once fully trained plus 12% superannuation. We invest in your growth — personally and professionally! Inclusive, welcoming culture where you can bring your whole self to work. Recognition and rewards through Post Perks and more! A sense of pride and purpose every time you put on your helmet! Join a Team That Reflects Australia At Australia Post, we’re committed to reflecting the diverse communities we serve. We actively welcome people of all genders, backgrounds, and walks of life — including Aboriginal and Torres Strait Islander peoples, people with disability, LGBTQIA+ individuals, and people of all ages. Need accessibility support or have questions? Contact our Diversity & Inclusion team at inclusivecareers@auspost.com.au See and hear what our Rider Academy has to offer you in becoming a Postie:",
    "Name": "Trainee Postie - St Leonards",
    "Site / Location": "St Leonards Delivery",
    "Ref #": "12379790",
    "Opening Date": "27-Jan-2026",
    "Suburb": "St Leonards",
    "State": "New South Wales"
},
{
    "job_url": "https://ciusss.avature.net/en_CA/careers/JobDetail/Agent-e-de-relations-humaines-CLSC-Ren-Cassin/4930",
    "description": null,
    "Organization:": "CIUSSS du Centre-Ouest-de-l'Île-de-Montréal",
    "Job Title:": "Agent.e de relations humaines - CLSC René-Cassin",
    "Ref #:": "5891",
    "Directorate:": "Direction du programme de soutien à l'autonomie des personnes âgées (SAPA) Soutien à domicile, RI-RTF et Ligne Aide Maltraitance Adultes Ainés (LAMAA)",
    "Site:": "CLSC René-Cassin",
    "Job City:": "Montréal",
    "Job Status:": "Temporaire à temps plein",
    "Work Shift:": "Jour",
    "Job Type:": "Syndiqué",
    "Number of hours per pay period:": "70",
    "Base Min:": "30.27",
    "Base Max:": "53.64",
    "Job Category:": "Professionnels en services sociaux (psychologie, travail social, psychoéducation, etc.)",
    "Number of positions available:": "1",
    "Organization description:": "Regroupant une grande variété d’établissements de santé affiliés à des universités dans le centre-ouest de Montréal, dont des hôpitaux, des centres de soins de longue durée et des CLSC, le Centre intégré universitaire de santé et de services sociaux (CIUSSS) du Centre-Ouest-de-l’Île-de-Montréal offre des possibilités infinies. Au sein de ce réseau, vous serez appelé à jouer un rôle de premier plan dans le soutien des continuums et trajectoires de soins pour les clients au sein d’établissements ayant reçu des mentions d’honneur et reconnus à travers le monde pour la qualité des soins et la recherche. Au CIUSSS, les membres du personnel sont au cœur du réseau. S’appuyant sur des valeurs de compassion et d’intégrité, le CIUSSS se distingue par son statut bilingue et sa riche identité culturelle. Notre engagement envers un lieu de travail inclusif Au CIUSSS-du-Centre-Ouest-de-l'Île-de-Montréal, la diversité est au cœur de qui nous sommes et de ce que nous faisons, chaque jour. C'est avec fierté que nous accueillons, valorisons et promouvons cette diversité dans nos équipes, constituées de personnes aux forces, expériences et parcours variés, partageant une passion pour l'excellence dans les soins et les services visant à améliorer la vie des gens. Nous adhérons au Programme d'accès à l'égalité en emploi (PAEE) et encourageons activement les candidatures des groupes désignés, tels que les femmes, les Autochtones, les personnes handicapées, ainsi que celles des minorités visibles et ethniques, dans le cadre de notre engagement pour un milieu de travail inclusif, équitable, diversifié et exempt de discrimination.  Pour toute demande de mesures d'adaptation durant le recrutement, contactez-nous confidentiellement à recrutement.ccomtl@ssss.gouv.qc.ca."
},
{
    "job_url": "https://apply.careers.transcom.com/en_US/careers/JobDetail/Accounting-Advisor-German-language/9264",
    "description": null,
    "Location": "Belgrade",
    "Job ID": "9264",
    "Job Category": "Operations",
    "Language Requirement": "German",
    "Description": "We’re looking for an experienced accounting professional with strong SAP skills and a solid accounting background. If you're detail-oriented, confident in managing receivables, and more importantly - proficient in Excel, join our international team and make an impact in a dynamic finance environment. Join us as an Accounting Advisor! Your main responsibilities would be: Monitoring of receivables management and the due dates of invoices and payment terms in SAP Allocating of customer payments with related invoices in SAP Daily checking payments and issuing necessary documents. Processing credit notes and debit notes Control of cash allocation and customer settlement for account reconciliation Control and monitoring of overdue management (dunning process) Monitoring of weekly internal reports Researching and investigating discrepancies in invoices to determine the accuracy of charges with related credit notes or claims Communicating other departments for customer claims and processing necessary documents Handling customer inquiries regarding billing issues Managing an Accounts Receivable ledger and Accounts Receivable files What's in it for YOU? Permanent employment with long-term career prospects Competitive salary based on experience and expertise Working hours 09-17h with weekends off Possibility of working from home Structured onboarding and support from experienced mentors Opportunities for advancement in a collaborative international environment What we expect: Fluency in German (C1/C2 level) – essential for communication and documentation English proficiency – a valuable asset for international coordination Prior experience with SAP – mandatory (ideally in Accounts Receivable and/or Payable) Strong accounting background – with practical knowledge of financial processes and principles Advanced Excel skills – including data analysis, reconciliation tools, and reporting functions Excellent analytical thinking and meticulous attention to detail What life at Transcom is like! At Transcom, we’re relentlessly committed. To our clients and each other. Every day, someone starts their journey with Transcom. Taking the potential they have today, and turning it into skills for the future. Getting recognized for working hard, being a team player, and supporting others. Championing positive, lasting change in their teams and communities. That’s just how we are at Transcom. Here we care, and root for each other. You’re included, just as you are, from day one. And with the right mindset, there’s no end to how far we can go together."
},
{
    "job_url": "https://discovermgs.avature.net/WorkMyWay/JobDetail/Austin-TX-United-States-Call-Center-Representative-Agent-Full-Time-Austin-TX/1439",
    "description": "Call Center Representative/Agent (Full Time) - Austin, TX Location: Austin, TX, United States Ref#: 1439 Posted: 03-25-2020 Industry: Call Center Share with: Facebook Twitter Send to a friend Overview Our clients are looking for Customer Service Representatives (CSR) who will have a direct impact on the customer’s satisfaction and experience with their company, products, and services. The CSR is responsible for answering incoming customer calls, providing appropriate level of service, and issuing resolutions according to the company’s guidelines while providing superior customer experience. Successful CSRs will be able to respond with empathy during difficult customer conversations, while simultaneously entering data on different screens. Primary Responsibilities Receive and answer customer questions and resolve concerns relating to claims, warranties, and product servicing. Follow standard screens/scripts as appropriate. Maintain and update customer account records as needed. Appropriately escalate customer questions and issues when necessary according to guidelines. Assess client needs and resolve claims according to insurance policy provisions and customer service guidelines. Coordinate with immediate supervisor or other personnel as needed to resolve claims and issues not of routine nature. Gather information and examine forms, policies, and other records as provided by claimant and other agencies or resources to make appropriate determination of resolution. Forward suspected fraudulent and questionable claims to appropriate personnel. Balance workload based on business needs between paperwork and in-bound calls. Responsible for meeting deadlines and requirements. Maintain and update product knowledge on an on-going basis and attend workshops, seminars, and other training sessions as appropriate. Build and maintain effective working relationships and support teamwork in meeting company goals. Understand how the CSR role fits into the larger organizational context and actively support others in the achievement of common goals. Maintain professionalism with all contacts, both internal and external and treat individuals with respect. Participate in special projects, assume new responsibilities, and adjust priorities as requested. Basic Qualifications High School Diploma or GED required. Minimum six months previous customer service experience. Ability to type 25 words per minute. Excellent customer service and communication skills. Ability to multi-task. Ability to work nights, weekends, and holidays. Preferred Experience, Skills & Knowledge Minimum of one year experience as a Customer Service Representative in a call center environment. Experience moving between multiple screens while entering data. Bilingual a plus. Register Now Send to a friend"
},
{
    "job_url": "https://jobs.dbschenker.com/en_US/jobsGlobal/JobDetail/Chef-d-quipe-Centre-de-donn-es-Team-Lead-Data-Centre/409956",
    "description": null
},
{
    "job_url": "https://nva.avature.net/jobs/JobDetail/Assistant-General-Manager-United-States-Texas-NVA/32446",
    "description": null
},
{
    "job_url": "https://missionpethealth.avature.net/careersmarketplace/JobDetail/Veterinary-Technician-Student-Extern/6093",
    "description": "Company Overview At Greenwich Animal Hospital, we are seeking compassionate professionals dedicated to excellence in veterinary medicine. Joining our team means committing to the highest standards of care, reflected in our status as an AAHA-Accredited practice. The community recognizes our commitment, evidenced by our excellent Google rating of 4.7 stars. We pride ourselves on creating a supportive environment where every teammate feels valued and inspired to deliver outstanding patient care. This is an exceptional opportunity for you to do your best work alongside some of the industry’s most talented individuals. We believe that supporting you professionally is central to providing exceptional medicine. As part of a broader network, Greenwich Animal Hospital offers stability and resources designed to help you grow your career. We actively foster a culture of education and mentorship, ensuring all teammates have access to development programs. Whether your goal is to become a credentialed technician, move into a leadership role, or master a new clinical skill, we provide the pathways and support you need to succeed and achieve your long-term career goals. Our focus is strictly on delivering high-quality small animal care, including essential urgent care services for our community. Being AAHA-Accredited ensures that our medical protocols, facility, and equipment are routinely held to the highest possible standards. Furthermore, our clinical teams benefit from access to internal specialty consultations and cutting-edge resources provided by our larger organization. This robust support structure empowers our veterinarians and technicians to pursue complex cases and continually expand the level of advanced medicine we provide to every patient. Located in the historic and prestigious town of Greenwich, Connecticut, you will find an ideal balance of professional challenge and sophisticated coastal living. Greenwich offers scenic beauty, renowned dining, and easy access to both New York City and the tranquility of the New England coastline. This community is affluent and deeply values high-quality service, meaning our hospital holds a respected position within the area. Joining us in Greenwich allows you to build a fulfilling life in a premier location while focusing on meaningful work.",
    "Ref #": "2018",
    "Department": "Vet Tech / Vet Assistant / VT Campus",
    "Job Site": "Greenwich Animal Hospital",
    "Date Published": "10-24-2025",
    "Pay Class": "Temp",
    "Base Min.": "$ 0",
    "Base Max.": "$ 0",
    "Company Overview": "At Greenwich Animal Hospital, we are seeking compassionate professionals dedicated to excellence in veterinary medicine. Joining our team means committing to the highest standards of care, reflected in our status as an AAHA-Accredited practice. The community recognizes our commitment, evidenced by our excellent Google rating of 4.7 stars. We pride ourselves on creating a supportive environment where every teammate feels valued and inspired to deliver outstanding patient care. This is an exceptional opportunity for you to do your best work alongside some of the industry’s most talented individuals. We believe that supporting you professionally is central to providing exceptional medicine. As part of a broader network, Greenwich Animal Hospital offers stability and resources designed to help you grow your career. We actively foster a culture of education and mentorship, ensuring all teammates have access to development programs. Whether your goal is to become a credentialed technician, move into a leadership role, or master a new clinical skill, we provide the pathways and support you need to succeed and achieve your long-term career goals. Our focus is strictly on delivering high-quality small animal care, including essential urgent care services for our community. Being AAHA-Accredited ensures that our medical protocols, facility, and equipment are routinely held to the highest possible standards. Furthermore, our clinical teams benefit from access to internal specialty consultations and cutting-edge resources provided by our larger organization. This robust support structure empowers our veterinarians and technicians to pursue complex cases and continually expand the level of advanced medicine we provide to every patient. Located in the historic and prestigious town of Greenwich, Connecticut, you will find an ideal balance of professional challenge and sophisticated coastal living. Greenwich offers scenic beauty, renowned dining, and easy access to both New York City and the tranquility of the New England coastline. This community is affluent and deeply values high-quality service, meaning our hospital holds a respected position within the area. Joining us in Greenwich allows you to build a fulfilling life in a premier location while focusing on meaningful work.",
    "Job Description": "Your Impact as a Veterinary Technician Extern This externship is your opportunity to gain invaluable hands-on experience in a fast-paced, professional veterinary setting. You'll work side-by-side with experienced veterinarians and credentialed technicians, applying your classroom knowledge to real-world cases and building the foundation for a successful career. Gain Practical Clinical Experience: You'll actively assist the medical team with patient care, observe a variety of procedures, and perform technical tasks under direct supervision. Learn from Experienced Mentors: You'll collaborate with and learn from dedicated veterinarians, technicians, and support teammates, receiving guidance and feedback to enhance your skills. Understand Hospital Operations: You'll support daily clinical functions, including patient intake and discharge processes, contributing to the smooth operation of the hospital. Develop Your Professional Skills: You'll practice effective communication with team members, learn clinical protocols, and build confidence in a dynamic veterinary environment."
},
{
    "job_url": "https://synopsys.avature.net/careers/JobDetail/Verification-Engineer-High-Speed-SerDes-13269/13269?businessTitle=Verification+Engineer+-High-Speed+SerDes+-+13269",
    "description": "Job Description and Requirements Location: Open to hiring for this position in the Ottawa, Toronto and Hillsboro, Oregon Markets We Are: At Synopsys, we drive the innovations that shape the way we live and connect. Our technology is central to the Era of Pervasive Intelligence, from self-driving cars to learning machines. We lead in chip design, verification, and IP integration, empowering the creation of high-performance silicon chips and software content. Join us to transform the future through continuous technological innovation. You Are: An accomplished verification engineer with deep expertise in mixed-signal systems, passionate about real number modeling (RNM) you will translate the nuanced behavior of leading-edge analog circuits into high-fidelity, scalable behavioral models. You’ll collaborate across engineering disciplines, driving model creation, integration, and continuous improvement for world-class SerDes verification. Your work will directly enhance the performance, efficiency, and quality of Synopsys' 224G & 448G connectivity products. What You’ll Be Doing: * Work closely with analog circuit teams to extract all necessary details, simulate, and sign off on high-fidelity models by rigorous comparison with SPICE-level simulations and silicon data * Develop and refine behavioural models of the analog portions of high-speed SerDes blocks (TX/RX, ADC, DAC, CDR, CTLE/equalizer, VGA/amplifier, PLL, VCO, Phase Interpolator). * Ensure models accurately capture all relevant functionalities, calibration/adaptation controls, time- and mode-dependent behaviors, key performance aspects, and residual impairments (offsets, gain mismatches, jitter, noise, skew, supply noise, etc.). * Interface with digital design and verification teams to guarantee exhaustive model verification—ensuring all functionalities and edge-cases are included in regression and integration test plans. * Reviewing execution against verification plans through regular meetings with multiple verification teams (analog, cosim, DV, GLS, formal, emulation). * Integrate behavioral models into modern verification environments (UVM, MS-MDV), utilizing assertion-based checks, analog/digital interface scoreboards, and power-aware techniques as appropriate. * Optimize model implementations for simulation speed and accuracy. * Drive continuous improvement and automation in the creation, maintenance, and validation of SerDes behavioral models. * Establish and evangelize best practices and reusable frameworks for efficient, scalable RNM modeling and mixed-signal verification. * Mentor and support teammates, sharing knowledge, methodology innovations, and documentation. The Impact You Will Have: * Enable rapid, rigorous, and coverage-driven verification of SerDes IP by deploying and validating high-quality RNM models. * Dramatically accelerate verification workflows—reducing dependence on AMS simulations and delivering faster, more predictable project schedules. * Deliver signoff-quality RNM models, validated against both SPICE simulation and silicon, to empower high-confidence tapeouts and market-leading silicon. * Solidify Synopsys’ reputation for high-performance, reliable, and thoroughly verified mixed-signal connectivity IP. * Enable successful silicon implementation by catching issues early through rigorous simulation and verification. * Facilitate cross-team collaboration that enhances product quality and reliability. What You’ll Need: * BSc, MSc or PhD in Electrical/Computer Engineering, with 7+ years of relevant industry experience. * Advanced proficiency with Verilog, SystemVerilog (including RNM, wreal modeling, and IEEE 1800-2012 SV-DC extensions). * Robust understanding of analog/mixed-signal SerDes sub-blocks: TX/RX, ADC, DAC, CDR, CTLE/equalizer, VGA/amplifier, PLL, VCO, Phase Interpolator. * Proven ability to model analog circuit impairments: offsets, gain/mismatches, jitter, noise, skew, supply noise, etc. * Fluency with analog schematics, SPICE-level simulation tools and waveform analysis. * Strong scripting/programming in Python, TCL, Perl, C/C++. * Familiarity with verification flows: regression, analog/mixed-signal co-simulation, digital verification, gate-level simulation, formal methods, and emulation. * Experience with UVM testbenches, assertion-driven and coverage-driven verification. Who You Are: * Comfortable with engaging across analog, digital, and mixed-signal teams. * Self-starter who welcomes challenges and proactively identifies and solves problems. * Constantly seeking ways to improve workflows, methodologies, and modeling quality. * Detail-focused and thoughtful—always considering boundary/edge-cases and full use-case coverage. * Strong communicator and mentor, able to share knowledge and guide others. * Adaptable, thriving in fast-paced and evolving environments. Synopsys Canada ULC values the diversity of our workforce. We are committed to provide access & opportunity to individuals with disabilities and will provide reasonable accommodation to individuals throughout the recruitment and employment process. Should you require an accommodation, please contact hr-help-canada@synopsys.com .",
    "Job Title": "Verification Engineer -High-Speed SerDes - 13269",
    "Job ID": "13269",
    "Country": "Canada",
    "City": "Mississauga",
    "State/Province": "Mississauga",
    "Date Posted": "03-Nov-2025",
    "Job Category": "Engineering",
    "Job Subcategory": "Analog Design",
    "Hire Type": "Employee",
    "Remote Eligible": "No",
    "Job Description and Requirements": "Location: Open to hiring for this position in the Ottawa, Toronto and Hillsboro, Oregon Markets We Are: At Synopsys, we drive the innovations that shape the way we live and connect. Our technology is central to the Era of Pervasive Intelligence, from self-driving cars to learning machines. We lead in chip design, verification, and IP integration, empowering the creation of high-performance silicon chips and software content. Join us to transform the future through continuous technological innovation. You Are: An accomplished verification engineer with deep expertise in mixed-signal systems, passionate about real number modeling (RNM) you will translate the nuanced behavior of leading-edge analog circuits into high-fidelity, scalable behavioral models. You’ll collaborate across engineering disciplines, driving model creation, integration, and continuous improvement for world-class SerDes verification. Your work will directly enhance the performance, efficiency, and quality of Synopsys' 224G & 448G connectivity products. What You’ll Be Doing: * Work closely with analog circuit teams to extract all necessary details, simulate, and sign off on high-fidelity models by rigorous comparison with SPICE-level simulations and silicon data * Develop and refine behavioural models of the analog portions of high-speed SerDes blocks (TX/RX, ADC, DAC, CDR, CTLE/equalizer, VGA/amplifier, PLL, VCO, Phase Interpolator). * Ensure models accurately capture all relevant functionalities, calibration/adaptation controls, time- and mode-dependent behaviors, key performance aspects, and residual impairments (offsets, gain mismatches, jitter, noise, skew, supply noise, etc.). * Interface with digital design and verification teams to guarantee exhaustive model verification—ensuring all functionalities and edge-cases are included in regression and integration test plans. * Reviewing execution against verification plans through regular meetings with multiple verification teams (analog, cosim, DV, GLS, formal, emulation). * Integrate behavioral models into modern verification environments (UVM, MS-MDV), utilizing assertion-based checks, analog/digital interface scoreboards, and power-aware techniques as appropriate. * Optimize model implementations for simulation speed and accuracy. * Drive continuous improvement and automation in the creation, maintenance, and validation of SerDes behavioral models. * Establish and evangelize best practices and reusable frameworks for efficient, scalable RNM modeling and mixed-signal verification. * Mentor and support teammates, sharing knowledge, methodology innovations, and documentation. The Impact You Will Have: * Enable rapid, rigorous, and coverage-driven verification of SerDes IP by deploying and validating high-quality RNM models. * Dramatically accelerate verification workflows—reducing dependence on AMS simulations and delivering faster, more predictable project schedules. * Deliver signoff-quality RNM models, validated against both SPICE simulation and silicon, to empower high-confidence tapeouts and market-leading silicon. * Solidify Synopsys’ reputation for high-performance, reliable, and thoroughly verified mixed-signal connectivity IP. * Enable successful silicon implementation by catching issues early through rigorous simulation and verification. * Facilitate cross-team collaboration that enhances product quality and reliability. What You’ll Need: * BSc, MSc or PhD in Electrical/Computer Engineering, with 7+ years of relevant industry experience. * Advanced proficiency with Verilog, SystemVerilog (including RNM, wreal modeling, and IEEE 1800-2012 SV-DC extensions). * Robust understanding of analog/mixed-signal SerDes sub-blocks: TX/RX, ADC, DAC, CDR, CTLE/equalizer, VGA/amplifier, PLL, VCO, Phase Interpolator. * Proven ability to model analog circuit impairments: offsets, gain/mismatches, jitter, noise, skew, supply noise, etc. * Fluency with analog schematics, SPICE-level simulation tools and waveform analysis. * Strong scripting/programming in Python, TCL, Perl, C/C++. * Familiarity with verification flows: regression, analog/mixed-signal co-simulation, digital verification, gate-level simulation, formal methods, and emulation. * Experience with UVM testbenches, assertion-driven and coverage-driven verification. Who You Are: * Comfortable with engaging across analog, digital, and mixed-signal teams. * Self-starter who welcomes challenges and proactively identifies and solves problems. * Constantly seeking ways to improve workflows, methodologies, and modeling quality. * Detail-focused and thoughtful—always considering boundary/edge-cases and full use-case coverage. * Strong communicator and mentor, able to share knowledge and guide others. * Adaptable, thriving in fast-paced and evolving environments."
},
{
    "job_url": "https://talent.stjude.org/careers/JobDetail/Sr-Administrative-Specialist-Pharmacy-and-Pharmaceutical-Sciences-JR6362/4249",
    "description": null,
    "Location": "Memphis, TN",
    "Category": "Administrative Operations",
    "Department": "Pharmacy & Pharmaceutical Sciences",
    "Shift": "Weekday Day",
    "Position Type": "Full Time",
    "Scheduled Weekly Hours": "40",
    "Req #": "JR6362"
},
{
    "job_url": "https://sodexo.avature.net/talentcommunity/JobDetail/Commerce-TX-Commerce-TX-United-States-HR-Assistant-at-ETAMU-in-Commerce-TX/148971",
    "description": "View all Jobs HR Assistant at ETAMU in Commerce, TX Job category: Food Service Job ID: 785049 Commerce, TX, Commerce, TX, United States Posted: 10-Jun-2025 Apply Now Good afternoon, I have exciting news! Sodexo on campus at East Texas A & M University in Commerce is seeking a Full-time Human Resources Assistant to join our team. We think you could be a great fit for this role. This full-time position runs Monday-Friday, with a starting pay of $14 to $16/hr. It includes excellent benefits and paid time off. Interested? Apply now for immediate consideration: https://sodexo.paradox.ai/co/Sodexo1/Job?job_id=P27-785049 Not interested? Please let us know either way. We look forward to your application! - The Sodexo Recruiting Team Willingness to be open to learning and growing. Maturity of judgment and behavior. Maintains high standards for work areas and appearance. Maintains a positive attitude. Ability to work a flexible schedule helpful. Must comply with any dress code requirements. Must be able to work nights, weekends and some holidays. Attends work and shows up for scheduled shift on time with satisfactory regularity. Experience/Knowledge: High School diploma, GED, or equivalent experience. 0 to 1 year related work experience. Skills/Aptitude: Presents self in a highly professional manner to others and understands that honesty and ethics are essential. Ability to maintain a positive attitude. Ability to communicate with co-workers and other departments with professionalism and respect. Maintains a professional relationship with all coworkers, vendor representatives, supervisors, managers, customers, and client representatives. Ability to use a computer. Ability to provide clear directions and respond to employees. Basic food-handling skills. Physical Requirements: Close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus, with or without corrective lenses. Significant walking or other means of mobility. Ability to work in a standing position for long periods of time (up to 8 hours). Ability to reach, bend, stoop, push and/or pull, and frequently lift up to 35 pounds and occasionally lift/move 40 pounds. Working Conditions (may add additional conditions specific to defined work location): Generally in an indoor setting; however, may supervise outside activities and events. Varying schedule to include evenings, holidays, weekends and extended hours as business dictates. While performing the duties of this job, the employee is primarily in a controlled, temperate environment; however, may be exposed to heat/cold during support of outside activities. The noise level in the work environment is usually moderate to loud. Sodexo is an EEO/AA/Minority/Female/Disability/Veteran employer. Apply Now Share: Facebook LinkedIn Twitter Google Plus via email"
},
{
    "job_url": "https://uclahealth.avature.net/careers/JobDetail/Associate-Director-of-Incident-Management/28252",
    "description": null,
    "Onsite or Remote": "Fully On-Site",
    "Work Schedule": "Monday-Friday 8:30am-5pm",
    "Posted Date": "01/14/2026",
    "Employment Type": "2 - Staff: Career",
    "Duration": "Indefinite",
    "Job #": "28166"
},
{
    "job_url": "https://govca.avature.net/en_US/GOVCACareers/JobDetail/Sacramento-California-United-States-Off-Highway-Motor-Vehicle-Recreation-Commission/15632",
    "description": null,
    "Agency": "Natural Resources Agency",
    "Department": "Natural Resources Agency",
    "Position Category": "Boards And Commissions"
},
{
    "job_url": "https://hkland.avature.net/en_US/currentopportunities/JobDetail/Senior-Accounts-Executive/807",
    "description": null,
    "Publish Date": "2026-01-29",
    "Location": "Singapore"
},
{
    "job_url": "https://jobs.totalenergies.com/en_US/careers/JobDetail/Senior-Reservoir-Geophysicist/76779",
    "description": null,
    "Country": "Mozambique",
    "City": "MAPUTO",
    "Workplace location": "MAPUTO-JULIUS NYERERE(MOZ)",
    "Employer company": "TotalEnergies EP Mozambique Area 1 Lda.",
    "Domain": "Geoscience & Reservoir",
    "Type of contract": "Regular position",
    "Experience": "Minimum 10 years"
},
{
    "job_url": "https://smurfitwestrockta.avature.net/en_US/careers/FolderDetail/Production-Associate/25811",
    "description": "Smurfit Westrock (NYSE:SW) is a global leader in sustainable paper and packaging solutions. We are materials scientists, packaging designers, mechanical engineers and manufacturing experts with a shared purpose: Innovate Boldly. Package Sustainably. Guided by our values of integrity, respect, accountability and excellence, we use leading science and technology to move fiber-based packaging forward. Must be open to working either 2nd or 3rd Shift ( 3pm-11pm or 11pm-7am) I. PRIMARY R ESPONSIBILITY: A.         To assist the Operator and Assistant Operator in the setup & operate when necessary any piece of equipment to run a corrugated box to meet customer specifications II.         SAFETY PROCEDURES: A.         Read and understand SAFETY RULES & HOUSEKEEPING GUIDELINES and receive training in proper operating procedures B.         Receive instructions in the following; 1.         Lockout procedures 2.         Hearing protection 3.         Safety shoes 4.         Moving machinery 5.         All stop buttons 6.         All nip points 7.         Conveyor safety 8. Lifting and pushing/pullin g 9.         Safety guards, gates & chains III.        HOUSEKEEPING: A.         Perform daily clean up of area B.         Dump trash as needed C.         Perform extra clan up during downtime D.         Follow cleaning schedule listed in Safety Manual E.         Keep scrap picked up IV.        MANUFACTURING PROCESS: A.         Read & use Factory Order & Print Card to determine proper equipment settings B.         Ability to know if equipment is operating properly C.         Ability to : 1.         Set stacker 2.         Install dies, attachments & printing plates 3.         Set pull rolls, collars & straps 4.         Set scores, heads & blade combinations 5.         Set Prefeeder & Lead Edge Feeder 6.         Check stock for correct size 7.         Adjust equipment for proper pressures & register 8.         Operate glue and ink systems 9.         Set folding rails, squaring section & ejector V.         EQUIPMENT OPERATED: A.         Flexo Folder Gluer equipment B.         Computer input terminal C.         Quality test equipment VI.        QUALITY: A.         Perform the following quality checks: 1.         1st piece dimensional checks 2.         1st piece print quality checks 3.         Random checks during run for dimensions & print 4.         Ink color & viscosity 5.         1st piece visual check - fold box complete B.         If major problem- shut machine down & notify supervisor VII. COMMUNICATION: A.         Push interrupt buttons B.         Verbal C.         Hand signals VIII.      EDUCATIONAL TRAINING: A.               Ability to read and do basic math B. Ability to read a tape measure Candidates are required to undergo a drug screening after receiving a conditional job offer, but before starting employment.",
    "Job ID": "ATR58322",
    "Posting Job Title": "Production Associate",
    "Locations": "FL Bradenton",
    "Employment Type": "Full Time",
    "Date Posted": "06-Feb-2026",
    "Relocation Support": "No"
},
{
    "job_url": "https://jobs.justice.gov.uk/careers/JobDetail/14686-Probation-Service-Officer-London-Approved-Premises/14686",
    "description": "Job description Approved Premises are community-based residential units, primarily for those who have been released on licence and who require a high level of supervision to manage the risk of harm they present to the public, victims, etc. Approved Premises play a key role in supporting the management of People on Probation in their transition from custody into the community. As part of your role as a Probation Service Officer, you will carry out keywork with the residents and engage with them in Rehabilitative Activities to assist their rehabilitation in the community. There is an expectation duties will be carried out between Monday - Friday (09:00 – 17:00, 37 hours per week) with occasional weekend working, which will be discussed with the line manager in advanced. Due to the nature of the work, remote or home working cannot be offered. Helping to keep the public safe. Giving people the chance to turn their lives around. Building a rewarding professional career. There are many reasons to join the Probation Service. What will yours be? We’re looking for empathetic, patient, and organised people to join us in this varied role, which offers the chance to make a difference, gain new skills and build a rewarding career within the Probation Service. If this sounds like you, apply now. If you are successful in the recruitment process to join the Probation Service, your starting salary will be £26,475 (Pro-rata for Part-time role) The Probation Service offers the opportunity for annual pay progression through a Competency Based Framework (CBF), which if eligible, will see your pay increase. CBF is designed to enable you to move up through the pay band range as your competence grows. New entrants are expected to join on the minimum of the pay band. Probation Service also increase their pay band ranges annually in line with Civil Service Pay guidance, which will also apply an increase to band pay ranges where applicable. Overview of the job The job holder will undertake the full range of work with people on probation before and after sentence. This will include assessment, sentence implementation, offender management and producing reports. The job holder will provide case management support to a full range of people on probation utilising service procedures and practice directions that underpin professional judgement. For further information on the summary, responsibilities, activities, duties of the role and the Civil Service Success Profile Criteria which will be used in the assessment process, please refer to the full Job Description Attachment. Right to work in the UK You must have the right to work in the UK and Civil Service ( https://www.gov.uk/government/publications/nationality-rules ). Skilled Worker visa changes from 22 July 2025 In accordance with current immigration rules, this role is not eligible for a new Skilled Worker visa. From 22 July 2025, the Government introduced changes to the eligibility criteria for Skilled Worker visas. As a result: HM Prison and Probation Service (HMPPS) cannot consider sponsoring you to work as a probation services officer unless you have held a Skilled Worker visa prior to the 22 July 2025 changes. If you have held a Skilled Worker visa continuously, please raise this during your pre-employment checks and your eligibility will be assessed in accordance with the immigration rules and transitional provisions in place. If you apply to be a probation services officer and you have not held a Skilled Worker visa prior to 22 July 2025, you will need to consider your options for obtaining and/or maintaining your right to work in the UK in light of these changes. If your application is successful, you will need to ensure that you have and maintain the legal right to live and work in the Civil Service and in the United Kingdom. HMPPS will continue to comply with UK Immigration Rules applied in the UK and Civil Service. You can read more about Skilled Worker visas and the eligibility criteria here. Civil Service recruitment: nationality rules Civil Service This guide is intended to assist departments with managing their responsibilities on nationality rules related to Civil Service recruitment. You can read more about Skilled Worker visas and the eligibility criteria here ( https://www.gov.uk/skilled-worker-visa ) About us: By managing offenders in the community, the Probation Service protects the public from the effect of crime and gives offenders the chance to turn their lives around. Join us and you’ll be part of a supportive team that thrives on sharing knowledge and expertise. Successful applicants may be based a wide variety of office, court, team, or prison locations within the Probation Service region. Allocations will be made according to business need. To find out more about working as a Probation Service Officer please click here About the Recruitment Process To apply to this role you will be required to complete a short application form and detail responses to Civil Service Behaviours and Experience based question. As part of this application, you will also be required to sit the Civil Service Judgement test (CSJT). The CSJT is a two-part test which looks at your ability to make decisions in relation to specific civil service behaviours. The CSJT is stage one of your application process and you will have the option to complete a practice test immediately before taking the test, to give you an insight of what to expect before you start. If you would like more information relating to reasonable adjustments and the CSJT, please see more details here . You can also watch a short a video here . You can find out more about the CSJT and complete a practice test now here . If you are successful in passing this stage, your full application will be sifted once the application deadline has closed. You will then receive further instruction on the progress and outcome of your application. If you are successful in passing both the CSJT and application sift process you will be invited to interview. If in the event we receive a high volume of applications, we may only assess candidates against the lead behaviour. There is also no guarantee that you will progress to the next stages of the recruitment process; however, we will keep you informed at each stage. Take a look at a short video about Probation Service Officer Role here About the role Probation services officers can help make a real difference to peoples’ lives. It’s not always easy to help someone turn their life around, but it can be immensely rewarding. We’re looking for empathetic, patient and resilient people to join us as probation services officers. As well as making a difference to others, the role offers plenty of on-the-job training and a real chance to build a career in the Probation Service. As a PSO, you’ll have a similar job to a fully qualified probation officer. The main difference is you’ll work with medium and lower risk people of probation. That’s not to say it’ll be easy. There’s no doubt this is a challenging role. Day-to-day, you’ll manage a caseload of offenders before and after sentence. We’ll look to you to assess and manage risks, provide information to courts and work closely with agencies throughout the justice system. You’ll also do everything you can to support offenders. This could involve everything from providing practical advice about housing and employment to simply listening and empathising. About you You don’t need a degree for this role. We’re much more interested in your personal qualities. Ideally with experience of working with people who have social or personal difficulties, you’ll be empathetic, patient and resilient. Good writing skills are also essential. You must be able to produce clear and accurate reports to tight deadlines. Additional Information Approved Premises (AP) provide critical community-based service to accommodate and closely supervise high-risk offenders on release from prison, for the purposes of public protection. AP are staffed 24 hours per day, with staff enforcing an overnight curfew, and other monitoring and reporting requirements. Probation Services Officers lead on the key interventions and rehabilitative activities with the resident group, working regular hours Monday to Friday but also covering at weekends as required. The provision of suitable accommodation on release is a key factor in reducing reoffending and supporting transition into the community. Where applicants provide multiple location preferences, reserve lists will be managed in accordance with location preference/s, as indicated in your application. We will appoint in merit list order for each location outlined in the vacancy and hold a separate locational reserve list for each of these locations. After appointments have been made using this locational appointment process, any remaining candidates who met the benchmark for the role will remain on a locational reserve list in accordance with their preferences for 12 months. Please only indicate preferences where you are prepared to work. If you are subsequently offered a role from the reserve list for a location preference indicated in your application and decline it, you will be removed from the reserve list for the vacancy, across all locational preferences. All offers of employment will be made strictly in merit order, based on your performance throughout the recruitment process. Candidates at the top of the merit list will be offered vacancies as they arise in their chosen locations. The addresses listed in the job advertisement are not an exhaustive list of potential base locations, they give an indication of some of the potential locations you could be based at. We will therefore endeavour to offer you a vacancy within a 60-minute commute of your home location. New entrants to the Civil Service will be expected to join at the entry point salary for the advertised band. Existing Civil Servants will have their salary calculated in accordance with the Departments pay on transfer / pay on promotion rules. Due to the length of this recruitment campaign, we will endeavour to inform you of your outcome following the interview. Successful candidates will be placed on a reserve list and will be allocated or offered roles once the campaign has fully concluded. The post is currently advertised without VISOR Vetting to enable appointment to take place as soon as possible, however, VISOR vetting will be required to be completed in post offer. Working Arrangements & Further Information The MoJ offers Hybrid Working arrangements where business need allows. This is an informal, non-contractual form of flexible working that blends working from your base location, different MoJ sites and / or from home (please be aware that this role can only be worked in the UK and not overseas). Some roles will not be suitable for Hybrid Working. Similarly, Hybrid Working will not suit everyone’s circumstances. Arrangements will be discussed and agreed with the successful candidate(s) and subject to regular review. For nationally advertised roles, the successful candidate(s) will be appointed to a MoJ office location, which may include their nearest Justice Collaboration Centre or Justice Satellite Office. This will be discussed and agreed on the completion of pre-employment checks. Some of MoJ’s terms and conditions of service are changing as part of Civil Service reform. The changes will apply to staff joining MoJ who are new to the Civil Service. Staff joining MoJ from other civil service employers will transfer onto the new MoJ terms if they are already on 'modernised' terms in their current post or onto 'unmodernised' MoJ terms if they are on 'unmodernised' terms at their current post. Details will be available if an offer is made. Standard full time working hours are 37 hours per week excluding breaks which are unpaid. HMPPS welcomes part-time, flexible and job-sharing working patterns, where they meet the demands of the role and business needs. All applications for part-time, flexible and job-sharing working patterns will be considered in accordance with the HMPPS’ Flexible Working policy. Benefits The MoJ offers a range of benefits: Annual Leave Annual leave is 25 days on appointment and will increase to 30 days after five years’ service, plus public holidays. Leave for part-time and job share posts will be calculated on a pro-rata basis Pension The National Probation Service is covered by the Local Government Pension Scheme (LGPS) run through the Greater Manchester Pension Fund (GMPF).  Please visit www.gmpf.org.uk for further information. Please note: Any current Civil Servant who is a member of the PCSPS, by accepting an offer of employment to the National Probation Services will be opted out of the PCSPS and auto enrolled into the Local Government Pension Scheme. Training The Ministry of Justice is committed to staff development and offers an extensive range of training and development opportunities. Networks The opportunity to join employee-run networks that have been established to provide advice and support and to enable the views of employees from minority groups to be expressed direct to senior management. There are currently networks for employees of minority ethnic origin, employees with disabilities, employees with caring responsibilities, women employees, and lesbian, gay, bisexual and transgender. Eligibility All candidates are subject to security and identity checks prior to taking up post Support A range of ‘Family Friendly’ policies such as      opportunities to work reduced hours or job share. Access to flexible benefits such as voluntary      benefits, retail vouchers and discounts on a range of goods and services. For moves to or from another employer or moves      across the Civil Service this can have implications on your eligibility to      carry on claiming childcare vouchers. You may however be eligible for      alternative government childcare support schemes, including Tax Free      Childcare. More information can be found on www.GOV.UK or Childcare Choices .  You can determine your      eligibility at https://www.childcarechoices.gov.uk/ . Paid paternity, adoption and maternity leave. Free annual sight tests for employees who use      computer screens. Working for the Civil Service The Civil Service Code sets out the standards of behaviour expected of civil servants. We recruit by merit on the basis of fair and open competition, as outlined in the Civil Service Commission's recruitment principles . Should you feel that the recruitment process has breached the recruitment principles you are able to raise a formal complaint in the following order To Transformative Business Services (0345 241      5358 (Monday to Friday 8am - 6pm) or e mail moj-recruitment-vetting-enquiries@resourcing.soprasteria.co.uk ); To Ministry of Justice Resourcing team ( resourcing-management-office@justice.gov.uk ); To the Civil Service Commission (details      available here ) As a Disability Confident employer, MoJ are committed to providing everyone with the opportunity to demonstrate their skills, talent and abilities, by making adjustments throughout all elements of the recruitment process and in the workplace. MoJ are able to offer an interview to disabled candidates who meet the minimum selection criteria, except in a limited number of campaigns. You will be able to request reasonable adjustments to the recruitment process within the application form. If you need additional help completing the application form, please contact the TBS Recruitment Enquiries Team. For more information on applying for a role as a candidate with a disability or long-term condition, please watch our animated videos . Diversity & Inclusion The Civil Service is committed to attract, retain and invest in talent wherever it is found. To learn more please see the Civil Service People Plan and the Civil Service Diversity and Inclusion Strategy . A Great Place to Work for Veterans The \"Making the Civil Service a Great Place to work for veterans\" initiative includes a guaranteed interview scheme to those who meet the minimum criteria to provide eligible former members of the Armed Forces with opportunities to secure rewarding jobs. Allowing veterans to continue to serve their country, and to bring highly skilled individuals with a broad range of experience into the Civil Service in an environment, which recognises and values your previous service in the Armed Forces. For further details about the initiative and eligibility requirements visit: https://www.gov.uk/government/news/making-the-civil-service-a-great-place-to-work-for-veterans Redeployment Interview Scheme Civil Service departments are expected to explore redeployment opportunities before making an individual redundant. The MoJ is committed, as part of the Redeployment Interview Scheme, to providing opportunities to those who are 'at risk of redundancy'. MoJ is able to offer an interview to eligible candidates who meet the minimum selection criteria, except in a limited number of campaigns. Candidates will not be eligible for the Redeployment Interview Scheme if they are applying on promotion. Civil Service Nationality Rules This job is broadly open to the following groups: UK nationals nationals of the      Republic of Ireland nationals of      Commonwealth countries who have the right to work in the UK nationals of the EU,      Switzerland, Norway, Iceland or Liechtenstein and family members of those      nationalities with settled or pre-settled status under the European Union      Settlement Scheme (EUSS) (opens in a new window) https://www.gov.uk/settled-status-eu-citizens-families nationals of the EU,      Switzerland, Norway, Iceland or Liechtenstein and family members of those      nationalities who have made a valid application for settled or pre-settled      status under the European Union Settlement Scheme (EUSS) individuals with      limited leave to remain or indefinite leave to remain who were eligible to      apply for EUSS on or before 31 December 2020 Turkish nationals, and      certain family members of Turkish nationals, who have accrued the right to      work in the Civil Service Further information on nationality requirements (opens in a new window) https://www.gov.uk/government/publications/nationality-rules Reserve list A reserve list may be held for up to 12 months from which further appointments may be made for the same or similar roles. Contact Information If you require any assistance please call 0345 241 5358 (Monday to Friday 8am - 6pm) or e mail moj-recruitment-vetting-enquiries@resourcing.soprasteria.co.uk Please quote the job reference Allowance plus a London Weighting Allowance of £4249",
    "Salary": "£26,475 - £31,650 (Pro-rata for Part-time roles)",
    "Working Pattern": "Full Time, Part Time",
    "Vacancy Approach": "External",
    "Location": "London",
    "Region": "London",
    "Closing Date": "01-Mar-2026",
    "Business Unit": "AGY - NOMS Agency",
    "Post Type": "Permanent",
    "Civil Service Grade": "Other",
    "Number of jobs available": "5",
    "Reserve List": "12 Months",
    "Job ID": "14686",
    "Job description": "Approved Premises are community-based residential units, primarily for those who have been released on licence and who require a high level of supervision to manage the risk of harm they present to the public, victims, etc. Approved Premises play a key role in supporting the management of People on Probation in their transition from custody into the community. As part of your role as a Probation Service Officer, you will carry out keywork with the residents and engage with them in Rehabilitative Activities to assist their rehabilitation in the community. There is an expectation duties will be carried out between Monday - Friday (09:00 – 17:00, 37 hours per week) with occasional weekend working, which will be discussed with the line manager in advanced. Due to the nature of the work, remote or home working cannot be offered. Helping to keep the public safe. Giving people the chance to turn their lives around. Building a rewarding professional career. There are many reasons to join the Probation Service. What will yours be? We’re looking for empathetic, patient, and organised people to join us in this varied role, which offers the chance to make a difference, gain new skills and build a rewarding career within the Probation Service. If this sounds like you, apply now. If you are successful in the recruitment process to join the Probation Service, your starting salary will be £26,475 (Pro-rata for Part-time role) The Probation Service offers the opportunity for annual pay progression through a Competency Based Framework (CBF), which if eligible, will see your pay increase. CBF is designed to enable you to move up through the pay band range as your competence grows. New entrants are expected to join on the minimum of the pay band. Probation Service also increase their pay band ranges annually in line with Civil Service Pay guidance, which will also apply an increase to band pay ranges where applicable. Overview of the job The job holder will undertake the full range of work with people on probation before and after sentence. This will include assessment, sentence implementation, offender management and producing reports. The job holder will provide case management support to a full range of people on probation utilising service procedures and practice directions that underpin professional judgement. For further information on the summary, responsibilities, activities, duties of the role and the Civil Service Success Profile Criteria which will be used in the assessment process, please refer to the full Job Description Attachment. Right to work in the UK You must have the right to work in the UK and Civil Service ( https://www.gov.uk/government/publications/nationality-rules ). Skilled Worker visa changes from 22 July 2025 In accordance with current immigration rules, this role is not eligible for a new Skilled Worker visa. From 22 July 2025, the Government introduced changes to the eligibility criteria for Skilled Worker visas. As a result: HM Prison and Probation Service (HMPPS) cannot consider sponsoring you to work as a probation services officer unless you have held a Skilled Worker visa prior to the 22 July 2025 changes. If you have held a Skilled Worker visa continuously, please raise this during your pre-employment checks and your eligibility will be assessed in accordance with the immigration rules and transitional provisions in place. If you apply to be a probation services officer and you have not held a Skilled Worker visa prior to 22 July 2025, you will need to consider your options for obtaining and/or maintaining your right to work in the UK in light of these changes. If your application is successful, you will need to ensure that you have and maintain the legal right to live and work in the Civil Service and in the United Kingdom. HMPPS will continue to comply with UK Immigration Rules applied in the UK and Civil Service. You can read more about Skilled Worker visas and the eligibility criteria here. Civil Service recruitment: nationality rules Civil Service This guide is intended to assist departments with managing their responsibilities on nationality rules related to Civil Service recruitment. You can read more about Skilled Worker visas and the eligibility criteria here ( https://www.gov.uk/skilled-worker-visa ) About us: By managing offenders in the community, the Probation Service protects the public from the effect of crime and gives offenders the chance to turn their lives around. Join us and you’ll be part of a supportive team that thrives on sharing knowledge and expertise. Successful applicants may be based a wide variety of office, court, team, or prison locations within the Probation Service region. Allocations will be made according to business need. To find out more about working as a Probation Service Officer please click here About the Recruitment Process To apply to this role you will be required to complete a short application form and detail responses to Civil Service Behaviours and Experience based question. As part of this application, you will also be required to sit the Civil Service Judgement test (CSJT). The CSJT is a two-part test which looks at your ability to make decisions in relation to specific civil service behaviours. The CSJT is stage one of your application process and you will have the option to complete a practice test immediately before taking the test, to give you an insight of what to expect before you start. If you would like more information relating to reasonable adjustments and the CSJT, please see more details here . You can also watch a short a video here . You can find out more about the CSJT and complete a practice test now here . If you are successful in passing this stage, your full application will be sifted once the application deadline has closed. You will then receive further instruction on the progress and outcome of your application. If you are successful in passing both the CSJT and application sift process you will be invited to interview. If in the event we receive a high volume of applications, we may only assess candidates against the lead behaviour. There is also no guarantee that you will progress to the next stages of the recruitment process; however, we will keep you informed at each stage. Take a look at a short video about Probation Service Officer Role here About the role Probation services officers can help make a real difference to peoples’ lives. It’s not always easy to help someone turn their life around, but it can be immensely rewarding. We’re looking for empathetic, patient and resilient people to join us as probation services officers. As well as making a difference to others, the role offers plenty of on-the-job training and a real chance to build a career in the Probation Service. As a PSO, you’ll have a similar job to a fully qualified probation officer. The main difference is you’ll work with medium and lower risk people of probation. That’s not to say it’ll be easy. There’s no doubt this is a challenging role. Day-to-day, you’ll manage a caseload of offenders before and after sentence. We’ll look to you to assess and manage risks, provide information to courts and work closely with agencies throughout the justice system. You’ll also do everything you can to support offenders. This could involve everything from providing practical advice about housing and employment to simply listening and empathising. About you You don’t need a degree for this role. We’re much more interested in your personal qualities. Ideally with experience of working with people who have social or personal difficulties, you’ll be empathetic, patient and resilient. Good writing skills are also essential. You must be able to produce clear and accurate reports to tight deadlines.",
    "Additional Information": "Approved Premises (AP) provide critical community-based service to accommodate and closely supervise high-risk offenders on release from prison, for the purposes of public protection. AP are staffed 24 hours per day, with staff enforcing an overnight curfew, and other monitoring and reporting requirements. Probation Services Officers lead on the key interventions and rehabilitative activities with the resident group, working regular hours Monday to Friday but also covering at weekends as required. The provision of suitable accommodation on release is a key factor in reducing reoffending and supporting transition into the community. Where applicants provide multiple location preferences, reserve lists will be managed in accordance with location preference/s, as indicated in your application. We will appoint in merit list order for each location outlined in the vacancy and hold a separate locational reserve list for each of these locations. After appointments have been made using this locational appointment process, any remaining candidates who met the benchmark for the role will remain on a locational reserve list in accordance with their preferences for 12 months. Please only indicate preferences where you are prepared to work. If you are subsequently offered a role from the reserve list for a location preference indicated in your application and decline it, you will be removed from the reserve list for the vacancy, across all locational preferences. All offers of employment will be made strictly in merit order, based on your performance throughout the recruitment process. Candidates at the top of the merit list will be offered vacancies as they arise in their chosen locations. The addresses listed in the job advertisement are not an exhaustive list of potential base locations, they give an indication of some of the potential locations you could be based at. We will therefore endeavour to offer you a vacancy within a 60-minute commute of your home location. New entrants to the Civil Service will be expected to join at the entry point salary for the advertised band. Existing Civil Servants will have their salary calculated in accordance with the Departments pay on transfer / pay on promotion rules. Due to the length of this recruitment campaign, we will endeavour to inform you of your outcome following the interview. Successful candidates will be placed on a reserve list and will be allocated or offered roles once the campaign has fully concluded. The post is currently advertised without VISOR Vetting to enable appointment to take place as soon as possible, however, VISOR vetting will be required to be completed in post offer. Working Arrangements & Further Information The MoJ offers Hybrid Working arrangements where business need allows. This is an informal, non-contractual form of flexible working that blends working from your base location, different MoJ sites and / or from home (please be aware that this role can only be worked in the UK and not overseas). Some roles will not be suitable for Hybrid Working. Similarly, Hybrid Working will not suit everyone’s circumstances. Arrangements will be discussed and agreed with the successful candidate(s) and subject to regular review. For nationally advertised roles, the successful candidate(s) will be appointed to a MoJ office location, which may include their nearest Justice Collaboration Centre or Justice Satellite Office. This will be discussed and agreed on the completion of pre-employment checks. Some of MoJ’s terms and conditions of service are changing as part of Civil Service reform. The changes will apply to staff joining MoJ who are new to the Civil Service. Staff joining MoJ from other civil service employers will transfer onto the new MoJ terms if they are already on 'modernised' terms in their current post or onto 'unmodernised' MoJ terms if they are on 'unmodernised' terms at their current post. Details will be available if an offer is made. Standard full time working hours are 37 hours per week excluding breaks which are unpaid. HMPPS welcomes part-time, flexible and job-sharing working patterns, where they meet the demands of the role and business needs. All applications for part-time, flexible and job-sharing working patterns will be considered in accordance with the HMPPS’ Flexible Working policy. Benefits The MoJ offers a range of benefits: Annual Leave Annual leave is 25 days on appointment and will increase to 30 days after five years’ service, plus public holidays. Leave for part-time and job share posts will be calculated on a pro-rata basis Pension The National Probation Service is covered by the Local Government Pension Scheme (LGPS) run through the Greater Manchester Pension Fund (GMPF).  Please visit www.gmpf.org.uk for further information. Please note: Any current Civil Servant who is a member of the PCSPS, by accepting an offer of employment to the National Probation Services will be opted out of the PCSPS and auto enrolled into the Local Government Pension Scheme. Training The Ministry of Justice is committed to staff development and offers an extensive range of training and development opportunities. Networks The opportunity to join employee-run networks that have been established to provide advice and support and to enable the views of employees from minority groups to be expressed direct to senior management. There are currently networks for employees of minority ethnic origin, employees with disabilities, employees with caring responsibilities, women employees, and lesbian, gay, bisexual and transgender. Eligibility All candidates are subject to security and identity checks prior to taking up post Support A range of ‘Family Friendly’ policies such as      opportunities to work reduced hours or job share. Access to flexible benefits such as voluntary      benefits, retail vouchers and discounts on a range of goods and services. For moves to or from another employer or moves      across the Civil Service this can have implications on your eligibility to      carry on claiming childcare vouchers. You may however be eligible for      alternative government childcare support schemes, including Tax Free      Childcare. More information can be found on www.GOV.UK or Childcare Choices .  You can determine your      eligibility at https://www.childcarechoices.gov.uk/ . Paid paternity, adoption and maternity leave. Free annual sight tests for employees who use      computer screens. Working for the Civil Service The Civil Service Code sets out the standards of behaviour expected of civil servants. We recruit by merit on the basis of fair and open competition, as outlined in the Civil Service Commission's recruitment principles . Should you feel that the recruitment process has breached the recruitment principles you are able to raise a formal complaint in the following order To Transformative Business Services (0345 241      5358 (Monday to Friday 8am - 6pm) or e mail moj-recruitment-vetting-enquiries@resourcing.soprasteria.co.uk ); To Ministry of Justice Resourcing team ( resourcing-management-office@justice.gov.uk ); To the Civil Service Commission (details      available here ) As a Disability Confident employer, MoJ are committed to providing everyone with the opportunity to demonstrate their skills, talent and abilities, by making adjustments throughout all elements of the recruitment process and in the workplace. MoJ are able to offer an interview to disabled candidates who meet the minimum selection criteria, except in a limited number of campaigns. You will be able to request reasonable adjustments to the recruitment process within the application form. If you need additional help completing the application form, please contact the TBS Recruitment Enquiries Team. For more information on applying for a role as a candidate with a disability or long-term condition, please watch our animated videos . Diversity & Inclusion The Civil Service is committed to attract, retain and invest in talent wherever it is found. To learn more please see the Civil Service People Plan and the Civil Service Diversity and Inclusion Strategy . A Great Place to Work for Veterans The \"Making the Civil Service a Great Place to work for veterans\" initiative includes a guaranteed interview scheme to those who meet the minimum criteria to provide eligible former members of the Armed Forces with opportunities to secure rewarding jobs. Allowing veterans to continue to serve their country, and to bring highly skilled individuals with a broad range of experience into the Civil Service in an environment, which recognises and values your previous service in the Armed Forces. For further details about the initiative and eligibility requirements visit: https://www.gov.uk/government/news/making-the-civil-service-a-great-place-to-work-for-veterans Redeployment Interview Scheme Civil Service departments are expected to explore redeployment opportunities before making an individual redundant. The MoJ is committed, as part of the Redeployment Interview Scheme, to providing opportunities to those who are 'at risk of redundancy'. MoJ is able to offer an interview to eligible candidates who meet the minimum selection criteria, except in a limited number of campaigns. Candidates will not be eligible for the Redeployment Interview Scheme if they are applying on promotion. Civil Service Nationality Rules This job is broadly open to the following groups: UK nationals nationals of the      Republic of Ireland nationals of      Commonwealth countries who have the right to work in the UK nationals of the EU,      Switzerland, Norway, Iceland or Liechtenstein and family members of those      nationalities with settled or pre-settled status under the European Union      Settlement Scheme (EUSS) (opens in a new window) https://www.gov.uk/settled-status-eu-citizens-families nationals of the EU,      Switzerland, Norway, Iceland or Liechtenstein and family members of those      nationalities who have made a valid application for settled or pre-settled      status under the European Union Settlement Scheme (EUSS) individuals with      limited leave to remain or indefinite leave to remain who were eligible to      apply for EUSS on or before 31 December 2020 Turkish nationals, and      certain family members of Turkish nationals, who have accrued the right to      work in the Civil Service Further information on nationality requirements (opens in a new window) https://www.gov.uk/government/publications/nationality-rules Reserve list A reserve list may be held for up to 12 months from which further appointments may be made for the same or similar roles.",
    "Contact Information": "If you require any assistance please call 0345 241 5358 (Monday to Friday 8am - 6pm) or e mail moj-recruitment-vetting-enquiries@resourcing.soprasteria.co.uk Please quote the job reference",
    "Allowance": "plus a London Weighting Allowance of £4249",
    "Behaviours Application Form Question Word Limit": "250",
    "We will assess your experience for this role via the following methods": "Experience Questions",
    "Experience Questions Application Form Question Word Limit": "250",
    "Evidence of  Experience": "Experience Questions",
    "Interview Dates": "To be confirmed"
},
{
    "job_url": "https://careers.twosigma.com/careers/JobDetail/New-York-New-York-United-States-HR-Business-Partner-Program-Manager/13668",
    "description": null,
    "Location": "NY New York",
    "Business": "Investment Management",
    "Function": "Strategy and Operations",
    "Experience Level": "Experienced"
}
]
